{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Collecting py2neo\n",
      "\u001b[?25l  Downloading https://files.pythonhosted.org/packages/af/41/c2d52a226b560618fe3df213a15e3f1ea3da09b8520a439756b619f3157d/py2neo-4.3.0.tar.gz (71kB)\n",
      "\u001b[K    100% |████████████████████████████████| 71kB 34.0MB/s ta 0:00:01\n",
      "\u001b[?25hRequirement already satisfied: certifi in /home/ec2-user/anaconda3/envs/python3/lib/python3.6/site-packages (from py2neo) (2019.6.16)\n",
      "Collecting click==7.0 (from py2neo)\n",
      "\u001b[?25l  Downloading https://files.pythonhosted.org/packages/fa/37/45185cb5abbc30d7257104c434fe0b07e5a195a6847506c074527aa599ec/Click-7.0-py2.py3-none-any.whl (81kB)\n",
      "\u001b[K    100% |████████████████████████████████| 81kB 37.1MB/s ta 0:00:01\n",
      "\u001b[?25hRequirement already satisfied: colorama in /home/ec2-user/anaconda3/envs/python3/lib/python3.6/site-packages (from py2neo) (0.3.9)\n",
      "Collecting neobolt~=1.7.12 (from py2neo)\n",
      "\u001b[?25l  Downloading https://files.pythonhosted.org/packages/9f/63/bb8b2ba18b4929c8bd17299d499530d6779635439e33bcc95043dc597223/neobolt-1.7.15.tar.gz (183kB)\n",
      "\u001b[K    100% |████████████████████████████████| 184kB 49.6MB/s ta 0:00:01\n",
      "\u001b[?25hCollecting neotime~=1.7.4 (from py2neo)\n",
      "  Downloading https://files.pythonhosted.org/packages/0b/7e/ca368a8d8e288be1352d4e2df35da1e01f8aaffbf526695df71630bcb8a6/neotime-1.7.4.tar.gz\n",
      "Collecting prompt_toolkit~=2.0.7 (from py2neo)\n",
      "\u001b[?25l  Downloading https://files.pythonhosted.org/packages/87/61/2dfea88583d5454e3a64f9308a686071d58d59a55db638268a6413e1eb6d/prompt_toolkit-2.0.10-py3-none-any.whl (340kB)\n",
      "\u001b[K    100% |████████████████████████████████| 348kB 39.6MB/s ta 0:00:01\n",
      "\u001b[?25hCollecting pygments~=2.3.1 (from py2neo)\n",
      "\u001b[?25l  Downloading https://files.pythonhosted.org/packages/13/e5/6d710c9cf96c31ac82657bcfb441df328b22df8564d58d0c4cd62612674c/Pygments-2.3.1-py2.py3-none-any.whl (849kB)\n",
      "\u001b[K    100% |████████████████████████████████| 849kB 31.4MB/s ta 0:00:01\n",
      "\u001b[?25hRequirement already satisfied: pytz in /home/ec2-user/anaconda3/envs/python3/lib/python3.6/site-packages (from py2neo) (2018.4)\n",
      "Requirement already satisfied: urllib3<1.25,>=1.23 in /home/ec2-user/anaconda3/envs/python3/lib/python3.6/site-packages (from py2neo) (1.23)\n",
      "Requirement already satisfied: six in /home/ec2-user/anaconda3/envs/python3/lib/python3.6/site-packages (from neotime~=1.7.4->py2neo) (1.11.0)\n",
      "Requirement already satisfied: wcwidth in /home/ec2-user/anaconda3/envs/python3/lib/python3.6/site-packages (from prompt_toolkit~=2.0.7->py2neo) (0.1.7)\n",
      "Building wheels for collected packages: py2neo, neobolt, neotime\n",
      "  Running setup.py bdist_wheel for py2neo ... \u001b[?25ldone\n",
      "\u001b[?25h  Stored in directory: /home/ec2-user/.cache/pip/wheels/86/7d/e3/35bd456d80e796ba1f98730b629352ebab5294c942e8fdd826\n",
      "  Running setup.py bdist_wheel for neobolt ... \u001b[?25ldone\n",
      "\u001b[?25h  Stored in directory: /home/ec2-user/.cache/pip/wheels/42/54/00/270de525f8f966d864bd3a0224d38dca2573b53c1a54267720\n",
      "  Running setup.py bdist_wheel for neotime ... \u001b[?25ldone\n",
      "\u001b[?25h  Stored in directory: /home/ec2-user/.cache/pip/wheels/d4/b4/c4/ab867cd0ac9e667f8cd269f9364fd1cb8ee75fe50f5ce97c79\n",
      "Successfully built py2neo neobolt neotime\n",
      "\u001b[31mjupyter-console 5.2.0 has requirement prompt_toolkit<2.0.0,>=1.0.0, but you'll have prompt-toolkit 2.0.10 which is incompatible.\u001b[0m\n",
      "\u001b[31mipython 6.4.0 has requirement prompt-toolkit<2.0.0,>=1.0.15, but you'll have prompt-toolkit 2.0.10 which is incompatible.\u001b[0m\n",
      "Installing collected packages: click, neobolt, neotime, prompt-toolkit, pygments, py2neo\n",
      "  Found existing installation: click 6.7\n",
      "    Uninstalling click-6.7:\n",
      "      Successfully uninstalled click-6.7\n",
      "  Found existing installation: prompt-toolkit 1.0.15\n",
      "    Uninstalling prompt-toolkit-1.0.15:\n",
      "      Successfully uninstalled prompt-toolkit-1.0.15\n",
      "  Found existing installation: Pygments 2.2.0\n",
      "    Uninstalling Pygments-2.2.0:\n",
      "      Successfully uninstalled Pygments-2.2.0\n",
      "Successfully installed click-7.0 neobolt-1.7.15 neotime-1.7.4 prompt-toolkit-2.0.10 py2neo-4.3.0 pygments-2.3.1\n",
      "\u001b[33mYou are using pip version 10.0.1, however version 19.2.3 is available.\n",
      "You should consider upgrading via the 'pip install --upgrade pip' command.\u001b[0m\n"
     ]
    }
   ],
   "source": [
    "! pip install py2neo\n",
    "from py2neo import Graph\n",
    "import pandas as pd\n",
    "import matplotlib.pyplot as plt\n",
    "import networkx as nx\n",
    "import seaborn as sns\n",
    "import numpy as np\n",
    "#i-0e23d19f0d8795714"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph = Graph(\"bolt://3.220.233.169:7687\", auth=(\"neo4j\", \"i-0e23d19f0d8795714\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'nodes': [(_-2:Category {constraints: [], indexes: ['name'], name: 'Category'}),\n",
       "   (_-3:User {constraints: ['CONSTRAINT ON ( user:User ) ASSERT user.id IS UNIQUE'], indexes: [], name: 'User'}),\n",
       "   (_-4:Review {constraints: ['CONSTRAINT ON ( review:Review ) ASSERT review.id IS UNIQUE'], indexes: [], name: 'Review'}),\n",
       "   (_-1:Business {constraints: ['CONSTRAINT ON ( business:Business ) ASSERT business.id IS UNIQUE'], indexes: [], name: 'Business'})],\n",
       "  'relationships': [(Review)-[:REVIEWS {}]->(Business),\n",
       "   (User)-[:WROTE {}]->(Review),\n",
       "   (User)-[:FRIEND {}]->(User),\n",
       "   (Business)-[:IN_CATEGORY {}]->(Category)]}]"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.run(\"CALL db.schema()\").data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 62,
   "metadata": {},
   "outputs": [],
   "source": [
    "cats=graph.run(\"\"\"MATCH (c:Category)\n",
    "RETURN distinct c.id \n",
    "\"\"\").to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 63,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(1300, 1)"
      ]
     },
     "execution_count": 63,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cats.shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "2336"
      ]
     },
     "execution_count": 52,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 58,
   "metadata": {},
   "outputs": [],
   "source": [
    "# sns.set_style(\"whitegrid\")\n",
    "# plt.figure(figsize=(14,10))\n",
    "# sns.boxplot(cat_count['count'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 59,
   "metadata": {},
   "outputs": [],
   "source": [
    "# sum(cat_count['count'].loc[cat_count['count']==1])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 60,
   "metadata": {},
   "outputs": [],
   "source": [
    "# thi is a cypher query to find nodes (in this case categories) of a certain degree\n",
    "# MATCH (c:Category)\n",
    "# WITH c, apoc.node.degree(c,\"IN_CATEGORY\") as degree\n",
    "# WHERE degree <5\n",
    "# RETURN c.id,degree"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 64,
   "metadata": {},
   "outputs": [],
   "source": [
    "user_count=graph.run(\"\"\"MATCH (c:User)\n",
    "return ID(c) as ident , apoc.node.degree(c, 'WROTE>') as count\n",
    "\"\"\").to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 65,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>count</th>\n",
       "      <th>ident</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>count</th>\n",
       "      <td>1.637138e+06</td>\n",
       "      <td>1.637138e+06</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>mean</th>\n",
       "      <td>4.083895e+00</td>\n",
       "      <td>3.490227e+06</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>std</th>\n",
       "      <td>1.469266e+01</td>\n",
       "      <td>2.408194e+06</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>min</th>\n",
       "      <td>1.000000e+00</td>\n",
       "      <td>1.950860e+05</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25%</th>\n",
       "      <td>1.000000e+00</td>\n",
       "      <td>1.344378e+06</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>50%</th>\n",
       "      <td>1.000000e+00</td>\n",
       "      <td>3.063662e+06</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>75%</th>\n",
       "      <td>3.000000e+00</td>\n",
       "      <td>5.402947e+06</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>max</th>\n",
       "      <td>4.129000e+03</td>\n",
       "      <td>8.512231e+06</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "              count         ident\n",
       "count  1.637138e+06  1.637138e+06\n",
       "mean   4.083895e+00  3.490227e+06\n",
       "std    1.469266e+01  2.408194e+06\n",
       "min    1.000000e+00  1.950860e+05\n",
       "25%    1.000000e+00  1.344378e+06\n",
       "50%    1.000000e+00  3.063662e+06\n",
       "75%    3.000000e+00  5.402947e+06\n",
       "max    4.129000e+03  8.512231e+06"
      ]
     },
     "execution_count": 65,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "user_count['count']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 74,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "array([1., 2.])"
      ]
     },
     "execution_count": 74,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "np.percentile(user_count['count'],[52,53])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "non_writers=user_count.loc[user_count['count']==0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(486400, 2)"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "non_writers.shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "# non_writers=graph.run(\"\"\"CALL apoc.periodic.iterate(\n",
    "# \"MATCH (u:User) WITH apoc.node.degree(u, 'WROTE>') as revs, u as u WHERE revs<1 RETURN u\",\n",
    "# \"DETACH DELETE u\", {batchSize:100, iterateList:true, parallel:false})\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'batches': 4864,\n",
       "  'total': 486400,\n",
       "  'timeTaken': 244,\n",
       "  'committedOperations': 486400,\n",
       "  'failedOperations': 0,\n",
       "  'failedBatches': 0,\n",
       "  'retries': 0,\n",
       "  'errorMessages': {},\n",
       "  'batch': {'total': 4864, 'committed': 4864, 'failed': 0, 'errors': {}},\n",
       "  'operations': {'total': 486400,\n",
       "   'committed': 486400,\n",
       "   'failed': 0,\n",
       "   'errors': {}},\n",
       "  'wasTerminated': False}]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "non_writers.data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "constraints_added: 0\n",
       "constraints_removed: 0\n",
       "contained_updates: False\n",
       "indexes_added: 0\n",
       "indexes_removed: 0\n",
       "labels_added: 0\n",
       "labels_removed: 0\n",
       "nodes_created: 0\n",
       "nodes_deleted: 0\n",
       "properties_set: 0\n",
       "relationships_created: 0\n",
       "relationships_deleted: 0"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 78,
   "metadata": {},
   "outputs": [],
   "source": [
    "friend_count=graph.run(\"\"\"MATCH (c:User)\n",
    "RETURN ID(c) as ident, apoc.node.degree(c, 'FRIEND') as count\n",
    "\"\"\").to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 79,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>count</th>\n",
       "      <th>ident</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>count</th>\n",
       "      <td>1.637138e+06</td>\n",
       "      <td>1.637138e+06</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>mean</th>\n",
       "      <td>2.754502e-01</td>\n",
       "      <td>3.490227e+06</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>std</th>\n",
       "      <td>1.131968e+00</td>\n",
       "      <td>2.408194e+06</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>min</th>\n",
       "      <td>0.000000e+00</td>\n",
       "      <td>1.950860e+05</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25%</th>\n",
       "      <td>0.000000e+00</td>\n",
       "      <td>1.344378e+06</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>50%</th>\n",
       "      <td>0.000000e+00</td>\n",
       "      <td>3.063662e+06</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>75%</th>\n",
       "      <td>0.000000e+00</td>\n",
       "      <td>5.402947e+06</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>max</th>\n",
       "      <td>3.450000e+02</td>\n",
       "      <td>8.512231e+06</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "              count         ident\n",
       "count  1.637138e+06  1.637138e+06\n",
       "mean   2.754502e-01  3.490227e+06\n",
       "std    1.131968e+00  2.408194e+06\n",
       "min    0.000000e+00  1.950860e+05\n",
       "25%    0.000000e+00  1.344378e+06\n",
       "50%    0.000000e+00  3.063662e+06\n",
       "75%    0.000000e+00  5.402947e+06\n",
       "max    3.450000e+02  8.512231e+06"
      ]
     },
     "execution_count": 79,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "friend_count.describe()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 108,
   "metadata": {},
   "outputs": [],
   "source": [
    "lame_os1=graph.run(\"\"\"\n",
    "MATCH (b:User)\n",
    "WITH ID(b) as ident, apoc.node.degree(b,\"WROTE\") as rdegree, apoc.node.degree(b,\"FRIEND\") as fdegree\n",
    "WHERE rdegree<2 and fdegree<1\n",
    "RETURN ident,rdegree,fdegree\"\"\").to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 109,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(744673, 3)"
      ]
     },
     "execution_count": 109,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "lame_os1.shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 110,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>fdegree</th>\n",
       "      <th>ident</th>\n",
       "      <th>rdegree</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>195091</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>0</td>\n",
       "      <td>195097</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>0</td>\n",
       "      <td>195109</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>0</td>\n",
       "      <td>195113</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>0</td>\n",
       "      <td>195115</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   fdegree   ident  rdegree\n",
       "0        0  195091        1\n",
       "1        0  195097        1\n",
       "2        0  195109        1\n",
       "3        0  195113        1\n",
       "4        0  195115        1"
      ]
     },
     "execution_count": 110,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "lame_os1.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 111,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>fdegree</th>\n",
       "      <th>ident</th>\n",
       "      <th>rdegree</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>count</th>\n",
       "      <td>744673.0</td>\n",
       "      <td>7.446730e+05</td>\n",
       "      <td>744673.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>mean</th>\n",
       "      <td>0.0</td>\n",
       "      <td>4.590623e+06</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>std</th>\n",
       "      <td>0.0</td>\n",
       "      <td>2.354850e+06</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>min</th>\n",
       "      <td>0.0</td>\n",
       "      <td>1.950910e+05</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25%</th>\n",
       "      <td>0.0</td>\n",
       "      <td>2.618982e+06</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>50%</th>\n",
       "      <td>0.0</td>\n",
       "      <td>4.655676e+06</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>75%</th>\n",
       "      <td>0.0</td>\n",
       "      <td>6.635882e+06</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>max</th>\n",
       "      <td>0.0</td>\n",
       "      <td>8.512231e+06</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "        fdegree         ident   rdegree\n",
       "count  744673.0  7.446730e+05  744673.0\n",
       "mean        0.0  4.590623e+06       1.0\n",
       "std         0.0  2.354850e+06       0.0\n",
       "min         0.0  1.950910e+05       1.0\n",
       "25%         0.0  2.618982e+06       1.0\n",
       "50%         0.0  4.655676e+06       1.0\n",
       "75%         0.0  6.635882e+06       1.0\n",
       "max         0.0  8.512231e+06       1.0"
      ]
     },
     "execution_count": 111,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "lame_os1.describe()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 113,
   "metadata": {},
   "outputs": [],
   "source": [
    "lame_os=graph.run(\"\"\"MATCH (b:User)\n",
    "WITH ID(b) as ident, apoc.node.degree(b) as degree\n",
    "WHERE degree<2\n",
    "RETURN ident,degree\"\"\").to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 114,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(744673, 2)"
      ]
     },
     "execution_count": 114,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "lame_os.shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 103,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>ident</th>\n",
       "      <th>rdegree</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>count</th>\n",
       "      <td>1.637138e+06</td>\n",
       "      <td>1.637138e+06</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>mean</th>\n",
       "      <td>3.490227e+06</td>\n",
       "      <td>4.083895e+00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>std</th>\n",
       "      <td>2.408194e+06</td>\n",
       "      <td>1.469266e+01</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>min</th>\n",
       "      <td>1.950860e+05</td>\n",
       "      <td>1.000000e+00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25%</th>\n",
       "      <td>1.344378e+06</td>\n",
       "      <td>1.000000e+00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>50%</th>\n",
       "      <td>3.063662e+06</td>\n",
       "      <td>1.000000e+00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>75%</th>\n",
       "      <td>5.402947e+06</td>\n",
       "      <td>3.000000e+00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>max</th>\n",
       "      <td>8.512231e+06</td>\n",
       "      <td>4.129000e+03</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "              ident       rdegree\n",
       "count  1.637138e+06  1.637138e+06\n",
       "mean   3.490227e+06  4.083895e+00\n",
       "std    2.408194e+06  1.469266e+01\n",
       "min    1.950860e+05  1.000000e+00\n",
       "25%    1.344378e+06  1.000000e+00\n",
       "50%    3.063662e+06  1.000000e+00\n",
       "75%    5.402947e+06  3.000000e+00\n",
       "max    8.512231e+06  4.129000e+03"
      ]
     },
     "execution_count": 103,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "lame_os.describe()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 107,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>ident</th>\n",
       "      <th>rdegree</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>195091</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>195097</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>195099</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>195109</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>195113</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    ident  rdegree\n",
       "0  195091        1\n",
       "1  195097        1\n",
       "2  195099        1\n",
       "3  195109        1\n",
       "4  195113        1"
      ]
     },
     "execution_count": 107,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "lame_os.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [],
   "source": [
    "biz_count=graph.run(\"\"\"MATCH (c:Business)\n",
    "RETURN ID(c) as ident , apoc.node.degree(c, '<REVIEWS') as count\n",
    "\"\"\").to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>count</th>\n",
       "      <th>ident</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>count</th>\n",
       "      <td>192609.000000</td>\n",
       "      <td>192609.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>mean</th>\n",
       "      <td>34.712293</td>\n",
       "      <td>98522.725465</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>std</th>\n",
       "      <td>113.601101</td>\n",
       "      <td>55891.470567</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>min</th>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25%</th>\n",
       "      <td>4.000000</td>\n",
       "      <td>50382.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>50%</th>\n",
       "      <td>9.000000</td>\n",
       "      <td>98667.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>75%</th>\n",
       "      <td>26.000000</td>\n",
       "      <td>146894.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>max</th>\n",
       "      <td>8570.000000</td>\n",
       "      <td>195085.000000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "               count          ident\n",
       "count  192609.000000  192609.000000\n",
       "mean       34.712293   98522.725465\n",
       "std       113.601101   55891.470567\n",
       "min         0.000000       0.000000\n",
       "25%         4.000000   50382.000000\n",
       "50%         9.000000   98667.000000\n",
       "75%        26.000000  146894.000000\n",
       "max      8570.000000  195085.000000"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "biz_count.describe()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 103,
   "metadata": {},
   "outputs": [],
   "source": [
    "# biz_select=graph.run(\"\"\"\n",
    "# MATCH (b:Business)\n",
    "# WITH ID(b) as ident, apoc.node.degree(b,\"<REVIEWS\") as degree\n",
    "# WHERE degree <5\n",
    "# RETURN ident,degree\"\"\").to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "metadata": {},
   "outputs": [],
   "source": [
    "# merge_categories=graph.run(\"\"\"MATCH (n:Category)\n",
    "# WITH trim(n.id) as name, collect(n) as nodes\n",
    "# CALL apoc.refactor.mergeNodes(nodes) yield node\n",
    "# RETURN node\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 61,
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>node</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>{'id': ' Golf'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>{'id': 'Active Life'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>{'id': ' Specialty Food'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>{'id': 'Restaurants'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>{'id': 'Dim Sum'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>{'id': 'Imported Food'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>{'id': 'Food'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>{'id': 'Chinese'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>{'id': 'Ethnic Food'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>{'id': 'Seafood'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>{'id': ' Sushi Bars'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>{'id': 'Japanese'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>{'id': ' Insurance'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>{'id': 'Financial Services'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>{'id': ' Plumbing'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>{'id': 'Shopping'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>{'id': 'Local Services'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>{'id': 'Home Services'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>{'id': 'Kitchen &amp; Bath'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>{'id': 'Home &amp; Garden'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>{'id': 'Water Heater Installation/Repair'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>{'id': ' Shipping Centers'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>{'id': 'Couriers &amp; Delivery Services'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>{'id': 'Printing Services'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>{'id': ' Beauty &amp; Spas'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>{'id': 'Hair Salons'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>{'id': 'Hair Stylists'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>{'id': 'Barbers'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>{'id': 'Men's Hair Salons'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>{'id': 'Cosmetics &amp; Beauty Supply'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1270</th>\n",
       "      <td>{'id': ' Sauna Installation &amp; Repair'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1271</th>\n",
       "      <td>{'id': ' Studio Taping'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1272</th>\n",
       "      <td>{'id': ' Bocce Ball'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1273</th>\n",
       "      <td>{'id': ' Sport Equipment Hire'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1274</th>\n",
       "      <td>{'id': ' Luggage Storage'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1275</th>\n",
       "      <td>{'id': ' Electricity Suppliers'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1276</th>\n",
       "      <td>{'id': ' Christmas Markets'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1277</th>\n",
       "      <td>{'id': ' Beer Hall'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1278</th>\n",
       "      <td>{'id': 'Soba'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1279</th>\n",
       "      <td>{'id': ' Neuropathologists'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1280</th>\n",
       "      <td>{'id': 'Nudist'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1281</th>\n",
       "      <td>{'id': ' Drive-Thru Bars'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1282</th>\n",
       "      <td>{'id': ' Bulgarian'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1283</th>\n",
       "      <td>{'id': ' Town Hall'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1284</th>\n",
       "      <td>{'id': ' Hang Gliding'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1285</th>\n",
       "      <td>{'id': ' Milkshake Bars'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1286</th>\n",
       "      <td>{'id': ' Hainan'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1287</th>\n",
       "      <td>{'id': ' Kitchen Incubators'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1288</th>\n",
       "      <td>{'id': 'Hybrid Car Repair'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1289</th>\n",
       "      <td>{'id': 'Linens'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1290</th>\n",
       "      <td>{'id': 'Calabrian'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1291</th>\n",
       "      <td>{'id': ' Halfway Houses'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1292</th>\n",
       "      <td>{'id': ' Otologists'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1293</th>\n",
       "      <td>{'id': ' Entertainment Law'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1294</th>\n",
       "      <td>{'id': ' Market Stalls'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1295</th>\n",
       "      <td>{'id': ' Senegalese'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1296</th>\n",
       "      <td>{'id': ' Osteopaths'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1297</th>\n",
       "      <td>{'id': ' Game Meat'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1298</th>\n",
       "      <td>{'id': ' Hotel bar'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1299</th>\n",
       "      <td>{'id': ' Churros'}</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1300 rows × 1 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                            node\n",
       "0                                {'id': ' Golf'}\n",
       "1                          {'id': 'Active Life'}\n",
       "2                      {'id': ' Specialty Food'}\n",
       "3                          {'id': 'Restaurants'}\n",
       "4                              {'id': 'Dim Sum'}\n",
       "5                        {'id': 'Imported Food'}\n",
       "6                                 {'id': 'Food'}\n",
       "7                              {'id': 'Chinese'}\n",
       "8                          {'id': 'Ethnic Food'}\n",
       "9                              {'id': 'Seafood'}\n",
       "10                         {'id': ' Sushi Bars'}\n",
       "11                            {'id': 'Japanese'}\n",
       "12                          {'id': ' Insurance'}\n",
       "13                  {'id': 'Financial Services'}\n",
       "14                           {'id': ' Plumbing'}\n",
       "15                            {'id': 'Shopping'}\n",
       "16                      {'id': 'Local Services'}\n",
       "17                       {'id': 'Home Services'}\n",
       "18                      {'id': 'Kitchen & Bath'}\n",
       "19                       {'id': 'Home & Garden'}\n",
       "20    {'id': 'Water Heater Installation/Repair'}\n",
       "21                   {'id': ' Shipping Centers'}\n",
       "22        {'id': 'Couriers & Delivery Services'}\n",
       "23                   {'id': 'Printing Services'}\n",
       "24                      {'id': ' Beauty & Spas'}\n",
       "25                         {'id': 'Hair Salons'}\n",
       "26                       {'id': 'Hair Stylists'}\n",
       "27                             {'id': 'Barbers'}\n",
       "28                   {'id': 'Men's Hair Salons'}\n",
       "29           {'id': 'Cosmetics & Beauty Supply'}\n",
       "...                                          ...\n",
       "1270      {'id': ' Sauna Installation & Repair'}\n",
       "1271                    {'id': ' Studio Taping'}\n",
       "1272                       {'id': ' Bocce Ball'}\n",
       "1273             {'id': ' Sport Equipment Hire'}\n",
       "1274                  {'id': ' Luggage Storage'}\n",
       "1275            {'id': ' Electricity Suppliers'}\n",
       "1276                {'id': ' Christmas Markets'}\n",
       "1277                        {'id': ' Beer Hall'}\n",
       "1278                              {'id': 'Soba'}\n",
       "1279                {'id': ' Neuropathologists'}\n",
       "1280                            {'id': 'Nudist'}\n",
       "1281                  {'id': ' Drive-Thru Bars'}\n",
       "1282                        {'id': ' Bulgarian'}\n",
       "1283                        {'id': ' Town Hall'}\n",
       "1284                     {'id': ' Hang Gliding'}\n",
       "1285                   {'id': ' Milkshake Bars'}\n",
       "1286                           {'id': ' Hainan'}\n",
       "1287               {'id': ' Kitchen Incubators'}\n",
       "1288                 {'id': 'Hybrid Car Repair'}\n",
       "1289                            {'id': 'Linens'}\n",
       "1290                         {'id': 'Calabrian'}\n",
       "1291                   {'id': ' Halfway Houses'}\n",
       "1292                       {'id': ' Otologists'}\n",
       "1293                {'id': ' Entertainment Law'}\n",
       "1294                    {'id': ' Market Stalls'}\n",
       "1295                       {'id': ' Senegalese'}\n",
       "1296                       {'id': ' Osteopaths'}\n",
       "1297                        {'id': ' Game Meat'}\n",
       "1298                        {'id': ' Hotel bar'}\n",
       "1299                          {'id': ' Churros'}\n",
       "\n",
       "[1300 rows x 1 columns]"
      ]
     },
     "execution_count": 61,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "merge_categories.to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "biz_select=graph.run(\"\"\"\n",
    "MATCH (u:User)\n",
    "RETURN ID(u) as ident, u.useful, u.funny, u.cool\"\"\").to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(1637138, 4)"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "biz_select.shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [],
   "source": [
    "dftemp=biz_select.fillna(0)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>ident</th>\n",
       "      <th>u.cool</th>\n",
       "      <th>u.funny</th>\n",
       "      <th>u.useful</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>count</th>\n",
       "      <td>1.637138e+06</td>\n",
       "      <td>1.637138e+06</td>\n",
       "      <td>1.637138e+06</td>\n",
       "      <td>1.637138e+06</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>mean</th>\n",
       "      <td>3.490227e+06</td>\n",
       "      <td>2.188046e+01</td>\n",
       "      <td>1.791785e+01</td>\n",
       "      <td>4.052770e+01</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>std</th>\n",
       "      <td>2.408194e+06</td>\n",
       "      <td>4.019675e+02</td>\n",
       "      <td>3.303504e+02</td>\n",
       "      <td>4.702421e+02</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>min</th>\n",
       "      <td>1.950860e+05</td>\n",
       "      <td>0.000000e+00</td>\n",
       "      <td>0.000000e+00</td>\n",
       "      <td>0.000000e+00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25%</th>\n",
       "      <td>1.344378e+06</td>\n",
       "      <td>0.000000e+00</td>\n",
       "      <td>0.000000e+00</td>\n",
       "      <td>0.000000e+00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>50%</th>\n",
       "      <td>3.063662e+06</td>\n",
       "      <td>0.000000e+00</td>\n",
       "      <td>0.000000e+00</td>\n",
       "      <td>3.000000e+00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>75%</th>\n",
       "      <td>5.402947e+06</td>\n",
       "      <td>3.000000e+00</td>\n",
       "      <td>3.000000e+00</td>\n",
       "      <td>1.300000e+01</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>max</th>\n",
       "      <td>8.512231e+06</td>\n",
       "      <td>1.486580e+05</td>\n",
       "      <td>1.302070e+05</td>\n",
       "      <td>1.542020e+05</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "              ident        u.cool       u.funny      u.useful\n",
       "count  1.637138e+06  1.637138e+06  1.637138e+06  1.637138e+06\n",
       "mean   3.490227e+06  2.188046e+01  1.791785e+01  4.052770e+01\n",
       "std    2.408194e+06  4.019675e+02  3.303504e+02  4.702421e+02\n",
       "min    1.950860e+05  0.000000e+00  0.000000e+00  0.000000e+00\n",
       "25%    1.344378e+06  0.000000e+00  0.000000e+00  0.000000e+00\n",
       "50%    3.063662e+06  0.000000e+00  0.000000e+00  3.000000e+00\n",
       "75%    5.402947e+06  3.000000e+00  3.000000e+00  1.300000e+01\n",
       "max    8.512231e+06  1.486580e+05  1.302070e+05  1.542020e+05"
      ]
     },
     "execution_count": 48,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "dftemp.describe()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>ident</th>\n",
       "      <th>u.cool</th>\n",
       "      <th>u.funny</th>\n",
       "      <th>u.useful</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0.20</th>\n",
       "      <td>1072521.40</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0.35</th>\n",
       "      <td>1968091.95</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0.50</th>\n",
       "      <td>3063662.50</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>3.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0.65</th>\n",
       "      <td>4389233.05</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>7.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0.80</th>\n",
       "      <td>5984803.60</td>\n",
       "      <td>5.0</td>\n",
       "      <td>4.0</td>\n",
       "      <td>19.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0.95</th>\n",
       "      <td>7830374.15</td>\n",
       "      <td>36.0</td>\n",
       "      <td>33.0</td>\n",
       "      <td>110.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "           ident  u.cool  u.funny  u.useful\n",
       "0.20  1072521.40     0.0      0.0       0.0\n",
       "0.35  1968091.95     0.0      0.0       1.0\n",
       "0.50  3063662.50     0.0      0.0       3.0\n",
       "0.65  4389233.05     1.0      1.0       7.0\n",
       "0.80  5984803.60     5.0      4.0      19.0\n",
       "0.95  7830374.15    36.0     33.0     110.0"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "dftemp.quantile(q=[.2,.35,.5,.65,.8,.95])"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "going to bin the useful, funny and coll user ratings into these in order to generate nodes to quickly lookup these attributes.\n",
    "\n",
    "| qunatile | ident | u.cool | u.funny | u.useful |\n",
    "| --- | --- | --- | --- | --- |\n",
    "| 0.20 | 1072521.40\t| 0.0 | 0.0 | 0.0 |\n",
    "| 0.35 | 1968091.95 | 0.0\t |0.0\t|1.0 |\n",
    "| 0.50 |\t3063662.50\t| 0.0\t | 0.0\t| 3.0 | \n",
    "| 0.65 |\t4389233.05\t| 1.0\t | 1.0\t| 7.0 |\n",
    "| 0.80 |\t5984803.60\t| 5.0\t | 4.0\t| 19.0 |\n",
    "| 0.95 |\t7830374.15\t| 36.0\t| 33.0\t| 110.0 |\n",
    "\n",
    "\n",
    "so cool and funny will get 4 bins and usefull will get 6."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [],
   "source": [
    "# cool1=graph.run(\"\"\"\n",
    "# MATCH (n:Reputation {cool:1})\n",
    "# MATCH (u:User) WHERE NOT exists(u.cool)\n",
    "# RETURN u.name, u.co\n",
    "# \"\"\").to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>n.cool</th>\n",
       "      <th>u.cool</th>\n",
       "      <th>u.name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Stefan</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Simon</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Reilly</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>A</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Beer</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Clint</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Pamela</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Rosy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Payam</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Laura</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Natalee</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>GB</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Michelle</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Aja</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Alexia</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Daniel</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Mina</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>christina</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Jasmine</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Melissa</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Yum</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Jeremy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Tess</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Bahar</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Derrick</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Richard</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Karen</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Tiffany</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Alexandra</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Lynn</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>825400</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Dakota</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>825401</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Gina</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>825402</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Keith</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>825403</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Shant</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>825404</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Kim</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>825405</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Marylin</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>825406</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>L</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>825407</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>John</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>825408</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Bailey</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>825409</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Maitte</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>825410</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Marianne</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>825411</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Phillip</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>825412</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Rhea</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>825413</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>O</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>825414</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>WIlson</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>825415</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Natalie</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>825416</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Madison</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>825417</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Catherine</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>825418</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Michael</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>825419</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Michael</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>825420</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Scott</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>825421</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Alex</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>825422</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Rose</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>825423</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Caree</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>825424</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Tom</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>825425</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Circe</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>825426</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Andrea</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>825427</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Carlos</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>825428</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Desi</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>825429</th>\n",
       "      <td>1</td>\n",
       "      <td>None</td>\n",
       "      <td>Jessica</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>825430 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "        n.cool u.cool     u.name\n",
       "0            1   None     Stefan\n",
       "1            1   None      Simon\n",
       "2            1   None     Reilly\n",
       "3            1   None          A\n",
       "4            1   None       Beer\n",
       "5            1   None      Clint\n",
       "6            1   None     Pamela\n",
       "7            1   None       Rosy\n",
       "8            1   None      Payam\n",
       "9            1   None      Laura\n",
       "10           1   None    Natalee\n",
       "11           1   None         GB\n",
       "12           1   None   Michelle\n",
       "13           1   None        Aja\n",
       "14           1   None     Alexia\n",
       "15           1   None     Daniel\n",
       "16           1   None       Mina\n",
       "17           1   None  christina\n",
       "18           1   None    Jasmine\n",
       "19           1   None    Melissa\n",
       "20           1   None        Yum\n",
       "21           1   None     Jeremy\n",
       "22           1   None       Tess\n",
       "23           1   None      Bahar\n",
       "24           1   None    Derrick\n",
       "25           1   None    Richard\n",
       "26           1   None      Karen\n",
       "27           1   None    Tiffany\n",
       "28           1   None  Alexandra\n",
       "29           1   None       Lynn\n",
       "...        ...    ...        ...\n",
       "825400       1   None     Dakota\n",
       "825401       1   None       Gina\n",
       "825402       1   None      Keith\n",
       "825403       1   None      Shant\n",
       "825404       1   None        Kim\n",
       "825405       1   None    Marylin\n",
       "825406       1   None          L\n",
       "825407       1   None       John\n",
       "825408       1   None     Bailey\n",
       "825409       1   None     Maitte\n",
       "825410       1   None   Marianne\n",
       "825411       1   None    Phillip\n",
       "825412       1   None       Rhea\n",
       "825413       1   None          O\n",
       "825414       1   None     WIlson\n",
       "825415       1   None    Natalie\n",
       "825416       1   None    Madison\n",
       "825417       1   None  Catherine\n",
       "825418       1   None    Michael\n",
       "825419       1   None    Michael\n",
       "825420       1   None      Scott\n",
       "825421       1   None       Alex\n",
       "825422       1   None       Rose\n",
       "825423       1   None      Caree\n",
       "825424       1   None        Tom\n",
       "825425       1   None      Circe\n",
       "825426       1   None     Andrea\n",
       "825427       1   None     Carlos\n",
       "825428       1   None       Desi\n",
       "825429       1   None    Jessica\n",
       "\n",
       "[825430 rows x 3 columns]"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cool1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [
    {
     "ename": "ClientError",
     "evalue": "SyntaxError: Invalid input '1': expected whitespace, comment, a relationship pattern, ',', USING, WHERE, FROM GRAPH, CONSTRUCT, LOAD CSV, START, MATCH, UNWIND, MERGE, CREATE UNIQUE, CREATE, SET, DELETE, REMOVE, FOREACH, WITH, CALL, RETURN, UNION, ';' or end of input (line 3, column 16 (offset: 26))\n\"MATCH (u:User) 1<u.cool<5\"\n                 ^",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mClientError\u001b[0m                               Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-33-f9b28576b0a5>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m()\u001b[0m\n\u001b[1;32m      3\u001b[0m \u001b[0mMATCH\u001b[0m \u001b[0;34m(\u001b[0m\u001b[0mu\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0mUser\u001b[0m\u001b[0;34m)\u001b[0m \u001b[0;36m1\u001b[0m\u001b[0;34m<\u001b[0m\u001b[0mu\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mcool\u001b[0m\u001b[0;34m<\u001b[0m\u001b[0;36m5\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m      4\u001b[0m \u001b[0mMERGE\u001b[0m \u001b[0;34m(\u001b[0m\u001b[0mu\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m-\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0mCOOL_LEVEL\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m->\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mn\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m----> 5\u001b[0;31m \"\"\")\n\u001b[0m",
      "\u001b[0;32m~/anaconda3/envs/python3/lib/python3.6/site-packages/py2neo/database.py\u001b[0m in \u001b[0;36mrun\u001b[0;34m(self, cypher, parameters, **kwparameters)\u001b[0m\n\u001b[1;32m    531\u001b[0m         \u001b[0;34m:\u001b[0m\u001b[0;32mreturn\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    532\u001b[0m         \"\"\"\n\u001b[0;32m--> 533\u001b[0;31m         \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mbegin\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mautocommit\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mTrue\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mrun\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mcypher\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mparameters\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0mkwparameters\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    534\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    535\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mseparate\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0msubgraph\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/python3/lib/python3.6/site-packages/py2neo/database.py\u001b[0m in \u001b[0;36mrun\u001b[0;34m(self, cypher, parameters, **kwparameters)\u001b[0m\n\u001b[1;32m    826\u001b[0m                                              \u001b[0mgraph\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mgraph\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    827\u001b[0m                                              \u001b[0mkeys\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 828\u001b[0;31m                                              entities=entities))\n\u001b[0m\u001b[1;32m    829\u001b[0m         \u001b[0;32mexcept\u001b[0m \u001b[0mCypherError\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0merror\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    830\u001b[0m             \u001b[0;32mraise\u001b[0m \u001b[0mGraphError\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mhydrate\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m{\u001b[0m\u001b[0;34m\"code\"\u001b[0m\u001b[0;34m:\u001b[0m \u001b[0merror\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mcode\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m\"message\"\u001b[0m\u001b[0;34m:\u001b[0m \u001b[0merror\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mmessage\u001b[0m\u001b[0;34m}\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/python3/lib/python3.6/site-packages/py2neo/internal/connectors.py\u001b[0m in \u001b[0;36mrun\u001b[0;34m(self, statement, parameters, tx, graph, keys, entities)\u001b[0m\n\u001b[1;32m    290\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mrun\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mstatement\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mparameters\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mtx\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mgraph\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mkeys\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mentities\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    291\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0mtx\u001b[0m \u001b[0;32mis\u001b[0m \u001b[0;32mNone\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 292\u001b[0;31m             \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_run_1\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mstatement\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mparameters\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mgraph\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mkeys\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mentities\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    293\u001b[0m         \u001b[0;32melse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    294\u001b[0m             \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_run_in_tx\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mstatement\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mparameters\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mtx\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mgraph\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mkeys\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mentities\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/python3/lib/python3.6/site-packages/py2neo/internal/connectors.py\u001b[0m in \u001b[0;36m_run_1\u001b[0;34m(self, statement, parameters, graph, keys, entities)\u001b[0m\n\u001b[1;32m    253\u001b[0m                     on_success=result.update_metadata, on_failure=self._fail, on_summary=result.done)\n\u001b[1;32m    254\u001b[0m         \u001b[0mcx\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msend\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 255\u001b[0;31m         \u001b[0mcx\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mfetch\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    256\u001b[0m         \u001b[0;32mreturn\u001b[0m \u001b[0mresult\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    257\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/python3/lib/python3.6/site-packages/neobolt/direct.py\u001b[0m in \u001b[0;36mfetch\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    420\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mfetch\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    421\u001b[0m         \u001b[0;32mtry\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 422\u001b[0;31m             \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_fetch\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    423\u001b[0m         \u001b[0;32mexcept\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0merror_handler\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mknown_errors\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0merror\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    424\u001b[0m             \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0merror_handler\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mhandle\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0merror\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0munresolved_address\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/python3/lib/python3.6/site-packages/neobolt/direct.py\u001b[0m in \u001b[0;36m_fetch\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    462\u001b[0m         \u001b[0;32melif\u001b[0m \u001b[0msummary_signature\u001b[0m \u001b[0;34m==\u001b[0m \u001b[0;34mb\"\\x7F\"\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    463\u001b[0m             \u001b[0mlog_debug\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"[#%04X]  S: FAILURE %r\"\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mlocal_port\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0msummary_metadata\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 464\u001b[0;31m             \u001b[0mresponse\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mon_failure\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0msummary_metadata\u001b[0m \u001b[0;32mor\u001b[0m \u001b[0;34m{\u001b[0m\u001b[0;34m}\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    465\u001b[0m         \u001b[0;32melse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    466\u001b[0m             \u001b[0;32mraise\u001b[0m \u001b[0mProtocolError\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"Unexpected response message with signature %02X\"\u001b[0m \u001b[0;34m%\u001b[0m \u001b[0msummary_signature\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/python3/lib/python3.6/site-packages/neobolt/direct.py\u001b[0m in \u001b[0;36mon_failure\u001b[0;34m(self, metadata)\u001b[0m\n\u001b[1;32m    753\u001b[0m         \u001b[0mhandler\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mhandlers\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mget\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"on_failure\"\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    754\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0mcallable\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mhandler\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 755\u001b[0;31m             \u001b[0mhandler\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mmetadata\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    756\u001b[0m         \u001b[0mhandler\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mhandlers\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mget\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"on_summary\"\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    757\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0mcallable\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mhandler\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/python3/lib/python3.6/site-packages/py2neo/internal/connectors.py\u001b[0m in \u001b[0;36m_fail\u001b[0;34m(cls, metadata)\u001b[0m\n\u001b[1;32m    286\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0m_fail\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mcls\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mmetadata\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    287\u001b[0m         \u001b[0;32mfrom\u001b[0m \u001b[0mpy2neo\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mdatabase\u001b[0m \u001b[0;32mimport\u001b[0m \u001b[0mGraphError\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 288\u001b[0;31m         \u001b[0;32mraise\u001b[0m \u001b[0mGraphError\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mhydrate\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mmetadata\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    289\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    290\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mrun\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mstatement\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mparameters\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mtx\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mgraph\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mkeys\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mentities\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mClientError\u001b[0m: SyntaxError: Invalid input '1': expected whitespace, comment, a relationship pattern, ',', USING, WHERE, FROM GRAPH, CONSTRUCT, LOAD CSV, START, MATCH, UNWIND, MERGE, CREATE UNIQUE, CREATE, SET, DELETE, REMOVE, FOREACH, WITH, CALL, RETURN, UNION, ';' or end of input (line 3, column 16 (offset: 26))\n\"MATCH (u:User) 1<u.cool<5\"\n                 ^"
     ]
    }
   ],
   "source": [
    "# cool2=graph.run(\"\"\"\n",
    "# MATCH (n)\n",
    "# WHERE ID(n)=6610\n",
    "# MATCH (u:User) \n",
    "# WHERE 1<u.cool<5\n",
    "# CREATE (u)-[:COOL_LEVEL]->(n)\n",
    "# \"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>n.cool</th>\n",
       "      <th>u.cool</th>\n",
       "      <th>u.id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>86J5DwcFk4f4In1Vxe2TvA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "      <td>3CJUJILq7CLHk_9OrvpvQg</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "      <td>8NwU4TRsD3S6gIfBqFzDMQ</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>2</td>\n",
       "      <td>2</td>\n",
       "      <td>1fi6x4tnJtlVWaJmoIO9XA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "      <td>_o740mSNRhMNYuPjSJoPLg</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>2</td>\n",
       "      <td>2</td>\n",
       "      <td>tAcB1ZohRtjozsymvqqHzQ</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "      <td>zFYFuufYWQSPj0r5lrKQKg</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "      <td>SvMGr_Oih7ivtzmnCL-Tmg</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>2</td>\n",
       "      <td>2</td>\n",
       "      <td>0nTJWagRU8_-KS1x7Zw5Yw</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>2</td>\n",
       "      <td>2</td>\n",
       "      <td>hzny0aF2jcUaY8rXN2bfJQ</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "      <td>SYRRQJoa5gQ8Duev4uSWag</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "      <td>fVK8D0rE9ez1fsQNW_bzRA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "      <td>oAOE4UAC5ZbAjEGBEMCb4g</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>-ifGqKj4_GZIPGcR5ox-xQ</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>2</td>\n",
       "      <td>2</td>\n",
       "      <td>qOiMHf9eBZhsvDSqauIiug</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>zN4M-hA86ps5I6BwXoqcqA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "      <td>XLLtQvZZjCFLjwatsMnetA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>9iMIjdMY99_igb1FmBXbwg</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>2</td>\n",
       "      <td>2</td>\n",
       "      <td>OuRmjIT8yj8w04XsLX1tlg</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>2</td>\n",
       "      <td>2</td>\n",
       "      <td>UF32lXb79D29HIk0BWdqWA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>2</td>\n",
       "      <td>2</td>\n",
       "      <td>JXfRZ2jlLfU1BSeG_rw6Jg</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>r31sCain9mZlv6E9eZUv0g</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "      <td>TcByPmEbsEQYJYT7IBKXdg</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>2</td>\n",
       "      <td>2</td>\n",
       "      <td>hhSOzS5D2OG1wHKew2JEdw</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>2</td>\n",
       "      <td>2</td>\n",
       "      <td>-RKsh-eKWJtDqnzTLCz-1Q</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>2</td>\n",
       "      <td>2</td>\n",
       "      <td>rJNdeta-dYO2YcJ3u5JxnA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>24a7xwHNCR2t0ZDl80-DaA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "      <td>FRZjef-q1gti4igt1LU0RA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>2</td>\n",
       "      <td>2</td>\n",
       "      <td>FBj6OZ5ks9wLmRJOAeGoXA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>gEqc7SFZEI_Z0eLRR0ouug</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>242166</th>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "      <td>XQc7TF18njXtnRsDhQrOgg</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>242167</th>\n",
       "      <td>2</td>\n",
       "      <td>2</td>\n",
       "      <td>YivHzATeKja6ZEbnJsqXRQ</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>242168</th>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>GMPKUwnHkMMF_312VhGpVQ</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>242169</th>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>auw0PrNPvlHAfh6wPomT6g</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>242170</th>\n",
       "      <td>2</td>\n",
       "      <td>2</td>\n",
       "      <td>5pGjs_MLDvkG0Xz6hlF_-Q</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>242171</th>\n",
       "      <td>2</td>\n",
       "      <td>2</td>\n",
       "      <td>Enj0gJ1RROEkMvKqFKiMsg</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>242172</th>\n",
       "      <td>2</td>\n",
       "      <td>2</td>\n",
       "      <td>mG1SRElljRwoIMdKGX1Ifg</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>242173</th>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "      <td>bMdxYzO2AJeO_zli0fVrOQ</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>242174</th>\n",
       "      <td>2</td>\n",
       "      <td>2</td>\n",
       "      <td>MDdTyjCxt8f9jlQ5bM8yVg</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>242175</th>\n",
       "      <td>2</td>\n",
       "      <td>2</td>\n",
       "      <td>yV2QH7-jRDfL6IkThIxuDg</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>242176</th>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>CnHPc5bO79urxHeZYB4Aag</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>242177</th>\n",
       "      <td>2</td>\n",
       "      <td>2</td>\n",
       "      <td>Jj3OLwn4Q2PBkMj4d4-LTw</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>242178</th>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>CCKUYFDR4UaZgcKd9IDlyg</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>242179</th>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>4wym5o0x5Fj8-bly9qbKnw</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>242180</th>\n",
       "      <td>2</td>\n",
       "      <td>2</td>\n",
       "      <td>vtm8YYKtFe4W4ESgTzXF1Q</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>242181</th>\n",
       "      <td>2</td>\n",
       "      <td>2</td>\n",
       "      <td>YrowrPaMIX4S14r9Bu-Fkw</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>242182</th>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>LqY0N4Cp4mraErtegD5PMw</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>242183</th>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "      <td>aEYpQkgTxnet482g0zWu8Q</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>242184</th>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>vLJL_pE02Yp-PzItABXH-A</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>242185</th>\n",
       "      <td>2</td>\n",
       "      <td>2</td>\n",
       "      <td>CgDxBSsHOORSsvT0YVX3zg</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>242186</th>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "      <td>SiPuHn_d1VGMhEpWQPQxtw</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>242187</th>\n",
       "      <td>2</td>\n",
       "      <td>2</td>\n",
       "      <td>qgAw7NAyT4DkqydMHgBowg</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>242188</th>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>6Z_FFE--A8VDUfBsTTUq5A</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>242189</th>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>oiD1hvsmKwY5zR-N6ytHlQ</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>242190</th>\n",
       "      <td>2</td>\n",
       "      <td>2</td>\n",
       "      <td>4-XIAMCDi9wjiqkSkyuvNw</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>242191</th>\n",
       "      <td>2</td>\n",
       "      <td>2</td>\n",
       "      <td>z2_U8Np4koPqMkW8Vg_qFQ</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>242192</th>\n",
       "      <td>2</td>\n",
       "      <td>2</td>\n",
       "      <td>sOd43UkSClARI1ocSyV3hA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>242193</th>\n",
       "      <td>2</td>\n",
       "      <td>2</td>\n",
       "      <td>fsNzRZYtx6jvIDZdf__lQg</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>242194</th>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>clH-t3-Lu2gTmtnRmosRjw</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>242195</th>\n",
       "      <td>2</td>\n",
       "      <td>2</td>\n",
       "      <td>PMttXkZ0XQwrUyUyjRtvzQ</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>242196 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "        n.cool  u.cool                    u.id\n",
       "0            2       3  86J5DwcFk4f4In1Vxe2TvA\n",
       "1            2       4  3CJUJILq7CLHk_9OrvpvQg\n",
       "2            2       4  8NwU4TRsD3S6gIfBqFzDMQ\n",
       "3            2       2  1fi6x4tnJtlVWaJmoIO9XA\n",
       "4            2       4  _o740mSNRhMNYuPjSJoPLg\n",
       "5            2       2  tAcB1ZohRtjozsymvqqHzQ\n",
       "6            2       4  zFYFuufYWQSPj0r5lrKQKg\n",
       "7            2       4  SvMGr_Oih7ivtzmnCL-Tmg\n",
       "8            2       2  0nTJWagRU8_-KS1x7Zw5Yw\n",
       "9            2       2  hzny0aF2jcUaY8rXN2bfJQ\n",
       "10           2       4  SYRRQJoa5gQ8Duev4uSWag\n",
       "11           2       4  fVK8D0rE9ez1fsQNW_bzRA\n",
       "12           2       4  oAOE4UAC5ZbAjEGBEMCb4g\n",
       "13           2       3  -ifGqKj4_GZIPGcR5ox-xQ\n",
       "14           2       2  qOiMHf9eBZhsvDSqauIiug\n",
       "15           2       3  zN4M-hA86ps5I6BwXoqcqA\n",
       "16           2       4  XLLtQvZZjCFLjwatsMnetA\n",
       "17           2       3  9iMIjdMY99_igb1FmBXbwg\n",
       "18           2       2  OuRmjIT8yj8w04XsLX1tlg\n",
       "19           2       2  UF32lXb79D29HIk0BWdqWA\n",
       "20           2       2  JXfRZ2jlLfU1BSeG_rw6Jg\n",
       "21           2       3  r31sCain9mZlv6E9eZUv0g\n",
       "22           2       4  TcByPmEbsEQYJYT7IBKXdg\n",
       "23           2       2  hhSOzS5D2OG1wHKew2JEdw\n",
       "24           2       2  -RKsh-eKWJtDqnzTLCz-1Q\n",
       "25           2       2  rJNdeta-dYO2YcJ3u5JxnA\n",
       "26           2       3  24a7xwHNCR2t0ZDl80-DaA\n",
       "27           2       4  FRZjef-q1gti4igt1LU0RA\n",
       "28           2       2  FBj6OZ5ks9wLmRJOAeGoXA\n",
       "29           2       3  gEqc7SFZEI_Z0eLRR0ouug\n",
       "...        ...     ...                     ...\n",
       "242166       2       4  XQc7TF18njXtnRsDhQrOgg\n",
       "242167       2       2  YivHzATeKja6ZEbnJsqXRQ\n",
       "242168       2       3  GMPKUwnHkMMF_312VhGpVQ\n",
       "242169       2       3  auw0PrNPvlHAfh6wPomT6g\n",
       "242170       2       2  5pGjs_MLDvkG0Xz6hlF_-Q\n",
       "242171       2       2  Enj0gJ1RROEkMvKqFKiMsg\n",
       "242172       2       2  mG1SRElljRwoIMdKGX1Ifg\n",
       "242173       2       4  bMdxYzO2AJeO_zli0fVrOQ\n",
       "242174       2       2  MDdTyjCxt8f9jlQ5bM8yVg\n",
       "242175       2       2  yV2QH7-jRDfL6IkThIxuDg\n",
       "242176       2       3  CnHPc5bO79urxHeZYB4Aag\n",
       "242177       2       2  Jj3OLwn4Q2PBkMj4d4-LTw\n",
       "242178       2       3  CCKUYFDR4UaZgcKd9IDlyg\n",
       "242179       2       3  4wym5o0x5Fj8-bly9qbKnw\n",
       "242180       2       2  vtm8YYKtFe4W4ESgTzXF1Q\n",
       "242181       2       2  YrowrPaMIX4S14r9Bu-Fkw\n",
       "242182       2       3  LqY0N4Cp4mraErtegD5PMw\n",
       "242183       2       4  aEYpQkgTxnet482g0zWu8Q\n",
       "242184       2       3  vLJL_pE02Yp-PzItABXH-A\n",
       "242185       2       2  CgDxBSsHOORSsvT0YVX3zg\n",
       "242186       2       4  SiPuHn_d1VGMhEpWQPQxtw\n",
       "242187       2       2  qgAw7NAyT4DkqydMHgBowg\n",
       "242188       2       3  6Z_FFE--A8VDUfBsTTUq5A\n",
       "242189       2       3  oiD1hvsmKwY5zR-N6ytHlQ\n",
       "242190       2       2  4-XIAMCDi9wjiqkSkyuvNw\n",
       "242191       2       2  z2_U8Np4koPqMkW8Vg_qFQ\n",
       "242192       2       2  sOd43UkSClARI1ocSyV3hA\n",
       "242193       2       2  fsNzRZYtx6jvIDZdf__lQg\n",
       "242194       2       3  clH-t3-Lu2gTmtnRmosRjw\n",
       "242195       2       2  PMttXkZ0XQwrUyUyjRtvzQ\n",
       "\n",
       "[242196 rows x 3 columns]"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cool2.to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [],
   "source": [
    "cool_level_2=graph.run(\"\"\"\n",
    "MATCH (n)\n",
    "WHERE ID(n)=6621\n",
    "MATCH (u:User) WHERE u.cool=1\n",
    "CREATE (u)-[:COOL_LEVEL]->(n)\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "metadata": {},
   "outputs": [],
   "source": [
    "cool_level_1=graph.run(\"\"\"\n",
    "MATCH (n)\n",
    "WHERE ID(n)=6557\n",
    "MATCH (u:User) WHERE NOT exists(u.cool)\n",
    "CREATE (u)-[:COOL_LEVEL]->(n)\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "metadata": {},
   "outputs": [],
   "source": [
    "cool_level_1=graph.run(\"\"\"\n",
    "MATCH (n)\n",
    "WHERE ID(n)=6625\n",
    "MATCH (u:User) WHERE u.cool>4\n",
    "CREATE (u)-[:COOL_LEVEL]->(n)\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "conda_python3",
   "language": "python",
   "name": "conda_python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
