{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "#!pip install neo4j\n",
    "from neo4j import GraphDatabase\n",
    "import pandas as pd\n",
    "import matplotlib.pyplot as plt\n",
    "import networkx as nx\n",
    "import seaborn as sns\n",
    "import numpy as np"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "#graph = Graph(\"bolt://3.220.233.169:7687\", auth=(\"neo4j\", \"i-0e23d19f0d8795714\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "uri = \"bolt://3.220.233.169:7687\"\n",
    "driver = GraphDatabase.driver(uri, auth=(\"neo4j\", \"i-0e23d19f0d8795714\"))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "This is coding through one example prediction piece by piece so that I can refactor this code into prediction functions for arbitrary person and business"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "id:195103, Chong. carlucciios tivoli gardens, id:17\n",
    "\n",
    "\n",
    "First phase is user preference. First step is getting number of reviews, average review score, and review score distribution"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 66,
   "metadata": {},
   "outputs": [],
   "source": [
    "review_dist=graph.run(\"\"\"\n",
    "MATCH (u:User)-[:WROTE]->(r:Review)\n",
    "WHERE ID(u)=195103\n",
    "RETURN ID(r), r.stars\n",
    "\"\"\").to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 67,
   "metadata": {},
   "outputs": [],
   "source": [
    "review_stars=review_dist['r.stars'].value_counts()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 68,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "4.0    18\n",
       "5.0    15\n",
       "3.0    13\n",
       "2.0     3\n",
       "Name: r.stars, dtype: int64"
      ]
     },
     "execution_count": 68,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "review_stars"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 129,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "3.9183673469387754"
      ]
     },
     "execution_count": 129,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "mean_review=review_dist['r.stars'].mean()\n",
    "mean_review"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 70,
   "metadata": {},
   "outputs": [],
   "source": [
    "num_reviews=review_dist['r.stars'].shape[0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 71,
   "metadata": {},
   "outputs": [],
   "source": [
    "tempdf=graph.run(\"\"\"\n",
    "MATCH (b:Business)-[:IN_CATEGORY]->(c:Category)\n",
    "WHERE ID(b)=17\n",
    "RETURN ID(c), c.id\n",
    "\"\"\").to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 72,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>ID(c)</th>\n",
       "      <th>c.id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>6003</td>\n",
       "      <td>Restaurants</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>6052</td>\n",
       "      <td>Italian</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   ID(c)         c.id\n",
       "0   6003  Restaurants\n",
       "1   6052      Italian"
      ]
     },
     "execution_count": 72,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "tempdf"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 73,
   "metadata": {},
   "outputs": [],
   "source": [
    "cat_id=list(tempdf['ID(c)'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 74,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[6003, 6052]"
      ]
     },
     "execution_count": 74,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cat_id"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 75,
   "metadata": {},
   "outputs": [],
   "source": [
    "bizlist=[]\n",
    "for cat in cat_id:\n",
    "    temp=graph.run(f\"MATCH (b:Business)-[:IN_CATEGORY]->(c:Category)\\\n",
    "    WHERE ID(c)={cat} RETURN ID(b)\").to_series()\n",
    "    bizlist.append(temp)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 103,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[191757, 92280]"
      ]
     },
     "execution_count": 103,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "list(bizlist[1])[0:2]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 77,
   "metadata": {},
   "outputs": [],
   "source": [
    "similar_biz=[]\n",
    "for i in range(len(bizlist)):\n",
    "    sim_biz = graph.run(f\"MATCH (u:User)-[:WROTE]->(r:Review)-[:REVIEWS]->(b:Business) WHERE ID(u)=195103 and ID(b) IN {list(bizlist[i])}\\\n",
    "    RETURN r.stars, ID(b)\").to_data_frame()\n",
    "    similar_biz.append(sim_biz)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 78,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[     ID(b)  r.stars\n",
       " 0    18179      3.0\n",
       " 1    20633      5.0\n",
       " 2    15420      5.0\n",
       " 3    20728      4.0\n",
       " 4    10924      4.0\n",
       " 5    33784      2.0\n",
       " 6    24002      3.0\n",
       " 7    33755      4.0\n",
       " 8    49324      3.0\n",
       " 9    57019      3.0\n",
       " 10   62704      5.0\n",
       " 11   91540      5.0\n",
       " 12   84569      4.0\n",
       " 13   91118      5.0\n",
       " 14  103683      5.0\n",
       " 15  114253      4.0\n",
       " 16   99165      3.0\n",
       " 17  113211      5.0\n",
       " 18  110749      4.0\n",
       " 19  122389      4.0\n",
       " 20  149120      4.0\n",
       " 21  144251      4.0\n",
       " 22  153199      3.0\n",
       " 23  151133      2.0\n",
       " 24  167760      4.0\n",
       " 25  159921      3.0\n",
       " 26  188708      5.0,     ID(b)  r.stars\n",
       " 0   62704      5.0\n",
       " 1  113211      5.0]"
      ]
     },
     "execution_count": 78,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "similar_biz"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 79,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "4.0    10\n",
       "5.0     8\n",
       "3.0     7\n",
       "2.0     2\n",
       "Name: r.stars, dtype: int64"
      ]
     },
     "execution_count": 79,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "similar_biz[0]['r.stars'].value_counts()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 80,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "5.0    2\n",
       "Name: r.stars, dtype: int64"
      ]
     },
     "execution_count": 80,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "similar_biz[1]['r.stars'].value_counts()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 92,
   "metadata": {},
   "outputs": [],
   "source": [
    "numerator=np.empty(5)\n",
    "for i in (1,2,3,4,5):\n",
    "    try:\n",
    "        numerator[i-1]=review_stars[i]\n",
    "    except:\n",
    "        numerator[i-1]=0\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 97,
   "metadata": {},
   "outputs": [],
   "source": [
    "PRu=(numerator+1)/(num_reviews+5)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 119,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "array([[ 0.,  2.,  7., 10.,  8.],\n",
       "       [ 0.,  0.,  0.,  0.,  2.]])"
      ]
     },
     "execution_count": 119,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "num_cat=len(similar_biz)\n",
    "cats_by_stars=np.empty((num_cat,5))\n",
    "\n",
    "for i in range(num_cat):\n",
    "    cat_stars=similar_biz[i]['r.stars'].value_counts()\n",
    "    for j in (1,2,3,4,5):\n",
    "        try:\n",
    "            cats_by_stars[i][j-1]=cat_stars[j]\n",
    "        except:\n",
    "            cats_by_stars[i][j-1]=0\n",
    "\n",
    "cats_by_stars"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 122,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "array([0.25      , 0.12      , 0.03555556, 0.0275    , 0.09342561])"
      ]
     },
     "execution_count": 122,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "PRaj=( (cats_by_stars+1) / (numerator+num_cat) ).prod(axis=0)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 126,
   "metadata": {},
   "outputs": [],
   "source": [
    "user_prefs_un_normalized=PRu*PRaj"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 127,
   "metadata": {},
   "outputs": [],
   "source": [
    "user_prefs=user_prefs_un_normalized/sum(user_prefs_un_normalized)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 128,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "array([0.07703953, 0.14791589, 0.15339426, 0.16101261, 0.46063772])"
      ]
     },
     "execution_count": 128,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "user_prefs"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "with driver.session() as session:\n",
    "    result = session.run(\"\\\n",
    "MATCH (u:User) \\\n",
    "UNWIND split(u.friends,',') as friendlist \\\n",
    "RETURN DISTINCT friendlist\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "friends=graph.run(\"\\\n",
    "MATCH (u:User) \\\n",
    "UNWIND split(u.friends,',') as friendlist \\\n",
    "RETURN DISTINCT friendlist\").to_series()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(14906537,)"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "friends.shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "sum(friends.duplicated()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "users=graph.run(\"\\\n",
    "MATCH (u:User) \\\n",
    "RETURN u.id\").to_series()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "with driver.session() as session:\n",
    "    result = session.run(\"\\\n",
    "MATCH (u:User) \\\n",
    "RETURN u.id\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "users=result.values()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [],
   "source": [
    "df = pd.DataFrame(users, columns =['userid'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [],
   "source": [
    "with driver.session() as session:\n",
    "    result = session.run(\"\\\n",
    "MATCH (b:Business) \\\n",
    "RETURN distinct b.city\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [],
   "source": [
    "cities=result.values()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 66,
   "metadata": {},
   "outputs": [],
   "source": [
    "cities_df = pd.DataFrame(cities, columns =['city'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 67,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(1204, 1)"
      ]
     },
     "execution_count": 67,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cities_df.shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 68,
   "metadata": {},
   "outputs": [],
   "source": [
    "# for city in cities_df['userid']\n",
    "# with driver.session() as session:\n",
    "#     result = session.run(\"\\\n",
    "# MATCH (b:Business) \\\n",
    "# RETURN distinct b.city\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 69,
   "metadata": {},
   "outputs": [],
   "source": [
    "cities_df2=pd.DataFrame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 70,
   "metadata": {},
   "outputs": [],
   "source": [
    "cities_df2['city']=cities_df['city'].str.strip()\n",
    "cities_df2['city']=cities_df['city'].str.lower()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 71,
   "metadata": {},
   "outputs": [],
   "source": [
    "cities_df2=cities_df2.drop_duplicates()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 73,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(1095, 1)"
      ]
     },
     "execution_count": 73,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cities_df2.shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 74,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>city</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>phoenix</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>mississauga</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>charlotte</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>goodyear</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>calgary</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "          city\n",
       "0      phoenix\n",
       "1  mississauga\n",
       "2    charlotte\n",
       "3     goodyear\n",
       "4      calgary"
      ]
     },
     "execution_count": 74,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cities_df2.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 92,
   "metadata": {},
   "outputs": [],
   "source": [
    "# for city in cities_df2['city']:\n",
    "#     with driver.session() as session:\n",
    "#         result = session.run(f'\\\n",
    "#     CREATE (c:City) \\\n",
    "#     SET c.name=\"{city}\" ')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 85,
   "metadata": {},
   "outputs": [],
   "source": [
    "summ=result.summary()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 89,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'    MERGE (c:City)     SET c.name=\"spring hill city view\" '"
      ]
     },
     "execution_count": 89,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 98,
   "metadata": {},
   "outputs": [
    {
     "ename": "KeyboardInterrupt",
     "evalue": "",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mKeyboardInterrupt\u001b[0m                         Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-98-74ca991cc7a6>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m()\u001b[0m\n\u001b[1;32m      1\u001b[0m \u001b[0;32mwith\u001b[0m \u001b[0mdriver\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msession\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0msession\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m----> 2\u001b[0;31m     \u001b[0mresult\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0msession\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mrun\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m'    MATCH (b:Business)     MATCH (c:City) WHERE c.name=tolower(trim(b.city))    SET c += {state:b.state}    CREATE (b)-[:IN_CITY]->(c)'\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m      3\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/python3/lib/python3.6/site-packages/neo4j/__init__.py\u001b[0m in \u001b[0;36mrun\u001b[0;34m(self, statement, parameters, **kwparameters)\u001b[0m\n\u001b[1;32m    498\u001b[0m                 \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_connection\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msend\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 499\u001b[0;31m                 \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_connection\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mfetch\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    500\u001b[0m             \u001b[0;32mexcept\u001b[0m \u001b[0mConnectionExpired\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0merror\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/python3/lib/python3.6/site-packages/neobolt/direct.py\u001b[0m in \u001b[0;36mfetch\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    421\u001b[0m         \u001b[0;32mtry\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 422\u001b[0;31m             \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_fetch\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    423\u001b[0m         \u001b[0;32mexcept\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0merror_handler\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mknown_errors\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0merror\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/python3/lib/python3.6/site-packages/neobolt/direct.py\u001b[0m in \u001b[0;36m_fetch\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    442\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 443\u001b[0;31m         \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_receive\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    444\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/python3/lib/python3.6/site-packages/neobolt/direct.py\u001b[0m in \u001b[0;36m_receive\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    492\u001b[0m         \u001b[0;32melif\u001b[0m \u001b[0mreceived\u001b[0m \u001b[0;34m==\u001b[0m \u001b[0;34m-\u001b[0m\u001b[0;36m1\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 493\u001b[0;31m             \u001b[0;32mraise\u001b[0m \u001b[0mKeyboardInterrupt\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    494\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mKeyboardInterrupt\u001b[0m: ",
      "\nDuring handling of the above exception, another exception occurred:\n",
      "\u001b[0;31mKeyboardInterrupt\u001b[0m                         Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-98-74ca991cc7a6>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m()\u001b[0m\n\u001b[1;32m      1\u001b[0m \u001b[0;32mwith\u001b[0m \u001b[0mdriver\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msession\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0msession\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m----> 2\u001b[0;31m     \u001b[0mresult\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0msession\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mrun\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m'    MATCH (b:Business)     MATCH (c:City) WHERE c.name=tolower(trim(b.city))    SET c += {state:b.state}    CREATE (b)-[:IN_CITY]->(c)'\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m      3\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/python3/lib/python3.6/site-packages/neo4j/__init__.py\u001b[0m in \u001b[0;36m__exit__\u001b[0;34m(self, exc_type, exc_value, traceback)\u001b[0m\n\u001b[1;32m    368\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    369\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0m__exit__\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mexc_type\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mexc_value\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mtraceback\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 370\u001b[0;31m         \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mclose\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    371\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    372\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0m_connect\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0maccess_mode\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/python3/lib/python3.6/site-packages/neo4j/__init__.py\u001b[0m in \u001b[0;36mclose\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    393\u001b[0m                 \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_transaction\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0;32mNone\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    394\u001b[0m             \u001b[0;32mtry\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 395\u001b[0;31m                 \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_connection\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msync\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    396\u001b[0m             except (ConnectionExpired, CypherError, TransactionError,\n\u001b[1;32m    397\u001b[0m                     ServiceUnavailable, SessionError):\n",
      "\u001b[0;32m~/anaconda3/envs/python3/lib/python3.6/site-packages/neobolt/direct.py\u001b[0m in \u001b[0;36msync\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    529\u001b[0m             \u001b[0mresponse\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mresponses\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;36m0\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    530\u001b[0m             \u001b[0;32mwhile\u001b[0m \u001b[0;32mnot\u001b[0m \u001b[0mresponse\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mcomplete\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 531\u001b[0;31m                 \u001b[0mdetail_delta\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0msummary_delta\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mfetch\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    532\u001b[0m                 \u001b[0mdetail_count\u001b[0m \u001b[0;34m+=\u001b[0m \u001b[0mdetail_delta\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    533\u001b[0m                 \u001b[0msummary_count\u001b[0m \u001b[0;34m+=\u001b[0m \u001b[0msummary_delta\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/python3/lib/python3.6/site-packages/neobolt/direct.py\u001b[0m in \u001b[0;36mfetch\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    420\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mfetch\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    421\u001b[0m         \u001b[0;32mtry\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 422\u001b[0;31m             \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_fetch\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    423\u001b[0m         \u001b[0;32mexcept\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0merror_handler\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mknown_errors\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0merror\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    424\u001b[0m             \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0merror_handler\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mhandle\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0merror\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0munresolved_address\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/python3/lib/python3.6/site-packages/neobolt/direct.py\u001b[0m in \u001b[0;36m_fetch\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    441\u001b[0m             \u001b[0;32mreturn\u001b[0m \u001b[0;36m0\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;36m0\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    442\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 443\u001b[0;31m         \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_receive\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    444\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    445\u001b[0m         \u001b[0mdetails\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0msummary_signature\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0msummary_metadata\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_unpack\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/python3/lib/python3.6/site-packages/neobolt/direct.py\u001b[0m in \u001b[0;36m_receive\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    491\u001b[0m             \u001b[0;32mraise\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mError\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mmessage\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    492\u001b[0m         \u001b[0;32melif\u001b[0m \u001b[0mreceived\u001b[0m \u001b[0;34m==\u001b[0m \u001b[0;34m-\u001b[0m\u001b[0;36m1\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 493\u001b[0;31m             \u001b[0;32mraise\u001b[0m \u001b[0mKeyboardInterrupt\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    494\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    495\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0m_unpack\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mKeyboardInterrupt\u001b[0m: "
     ]
    }
   ],
   "source": [
    "with driver.session() as session:\n",
    "    result = session.run('\\\n",
    "    MATCH (b:Business) \\\n",
    "    MATCH (c:City) WHERE c.name=tolower(trim(b.city))\\\n",
    "    SET c += {state:b.state}\\\n",
    "    CREATE (b)-[:IN_CITY]->(c)')\n",
    "   \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 127,
   "metadata": {},
   "outputs": [],
   "source": [
    "with driver.session() as session:\n",
    "    result = session.run('\\\n",
    "    MATCH (b:Business) \\\n",
    "    RETURN apoc.node.degree(b,\"IN_CITY\")')\n",
    "\n",
    "bizdegree=result.values()\n",
    "\n",
    "\n",
    "bizdegdf=pd.DataFrame(bizdegree)\n",
    "\n",
    "bizdegdf[0].value_counts()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Fixed two of them manuaslly, created one edge deleted one edge"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 176,
   "metadata": {},
   "outputs": [],
   "source": [
    "with driver.session() as session:\n",
    "    result = session.run('\\\n",
    "    MATCH (c:City) \\\n",
    "    RETURN distinct c.state')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 177,
   "metadata": {},
   "outputs": [],
   "source": [
    "states=pd.DataFrame(result.values(),columns=['state'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 178,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>state</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>AZ</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>CA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>QC</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>NV</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>OH</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>WI</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>AB</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>UT</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>PA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>NC</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>SC</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>ON</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>AL</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>IL</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>XGL</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>DOW</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>XWY</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>XGM</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>WA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>NY</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>CT</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>TX</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>CON</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>FL</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>VA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>VT</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>TN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>NJ</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>NE</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   state\n",
       "0     AZ\n",
       "1     CA\n",
       "2     QC\n",
       "3     NV\n",
       "4     OH\n",
       "5     WI\n",
       "6     AB\n",
       "7     UT\n",
       "8     PA\n",
       "9     NC\n",
       "10    SC\n",
       "11    ON\n",
       "12    AL\n",
       "13    IL\n",
       "14   XGL\n",
       "15   DOW\n",
       "16   XWY\n",
       "17   XGM\n",
       "18    WA\n",
       "19    NY\n",
       "20    CT\n",
       "21    TX\n",
       "22   CON\n",
       "23    FL\n",
       "24    VA\n",
       "25    VT\n",
       "26    TN\n",
       "27    NJ\n",
       "28    NE"
      ]
     },
     "execution_count": 178,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "states"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 148,
   "metadata": {},
   "outputs": [],
   "source": [
    "with driver.session() as session:\n",
    "    result = session.run('\\\n",
    "    MATCH (c:City) \\\n",
    "    MERGE (s:State {name:c.state}) \\\n",
    "    ON CREATE SET s.name=c.state \\\n",
    "    MERGE (c)-[:IN_STATE]->(s)')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 170,
   "metadata": {},
   "outputs": [],
   "source": [
    "with driver.session() as session:\n",
    "    result = session.run('\\\n",
    "    MATCH (s:State)<-[:IN_STATE]-(c:City)\\\n",
    "    RETURN s.name, apoc.node.degree(s,\"IN_STATE\"), c.name, apoc.node.degree(c,\"IN_CITY\")')\n",
    "\n",
    "counts_by_state=result.values()\n",
    "\n",
    "countsdf=pd.DataFrame(counts_by_state)\n",
    "\n",
    "countsdf.groupby(0).sum()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "with driver.session() as session:\n",
    "    result = session.run('\\\n",
    "    MATCH (s:State)<-[:IN_STATE]-(c:City)<-[:IN_CITY]-(b:Business)\\\n",
    "    RETURN  b.name, apoc.node.degree(b,\"REVIEWS\"), s.name, c.name')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "rev_counts=result.values()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "rev_countsdf=pd.DataFrame(rev_counts)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>0</th>\n",
       "      <th>1</th>\n",
       "      <th>2</th>\n",
       "      <th>3</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Homestead Steaks</td>\n",
       "      <td>8</td>\n",
       "      <td>NE</td>\n",
       "      <td>omaha</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Tiffani Tonkinson, DDS</td>\n",
       "      <td>5</td>\n",
       "      <td>AL</td>\n",
       "      <td>henderson nevada</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Di Dee's Diner</td>\n",
       "      <td>7</td>\n",
       "      <td>SC</td>\n",
       "      <td>lancaster</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Redbarn at Larkspur Ranch</td>\n",
       "      <td>3</td>\n",
       "      <td>SC</td>\n",
       "      <td>lancaster</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Spa &amp; Bodywork</td>\n",
       "      <td>5</td>\n",
       "      <td>SC</td>\n",
       "      <td>lancaster</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                           0  1   2                 3\n",
       "0           Homestead Steaks  8  NE             omaha\n",
       "1     Tiffani Tonkinson, DDS  5  AL  henderson nevada\n",
       "2             Di Dee's Diner  7  SC         lancaster\n",
       "3  Redbarn at Larkspur Ranch  3  SC         lancaster\n",
       "4             Spa & Bodywork  5  SC         lancaster"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "rev_countsdf.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "rev_counts_by_state=rev_countsdf.groupby(2).sum()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>1</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>AB</th>\n",
       "      <td>99616</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>AL</th>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>AZ</th>\n",
       "      <td>2083011</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>CA</th>\n",
       "      <td>179</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>CON</th>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>CT</th>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>DOW</th>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>FL</th>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>IL</th>\n",
       "      <td>42378</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>NC</th>\n",
       "      <td>410986</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>NE</th>\n",
       "      <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>NJ</th>\n",
       "      <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>NV</th>\n",
       "      <td>2321234</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>NY</th>\n",
       "      <td>175</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>OH</th>\n",
       "      <td>324317</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>ON</th>\n",
       "      <td>779896</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>PA</th>\n",
       "      <td>292321</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>QC</th>\n",
       "      <td>178971</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>SC</th>\n",
       "      <td>21265</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>TN</th>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>TX</th>\n",
       "      <td>23</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>UT</th>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>VA</th>\n",
       "      <td>9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>VT</th>\n",
       "      <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>WA</th>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>WI</th>\n",
       "      <td>131434</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>XGL</th>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>XGM</th>\n",
       "      <td>14</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>XWY</th>\n",
       "      <td>8</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "           1\n",
       "2           \n",
       "AB     99616\n",
       "AL         5\n",
       "AZ   2083011\n",
       "CA       179\n",
       "CON        3\n",
       "CT        10\n",
       "DOW        4\n",
       "FL         4\n",
       "IL     42378\n",
       "NC    410986\n",
       "NE         8\n",
       "NJ         8\n",
       "NV   2321234\n",
       "NY       175\n",
       "OH    324317\n",
       "ON    779896\n",
       "PA    292321\n",
       "QC    178971\n",
       "SC     21265\n",
       "TN         3\n",
       "TX        23\n",
       "UT         4\n",
       "VA         9\n",
       "VT         8\n",
       "WA         3\n",
       "WI    131434\n",
       "XGL        3\n",
       "XGM       14\n",
       "XWY        8"
      ]
     },
     "execution_count": 41,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "rev_counts_by_state\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Help on class Choropleth in module plotly.graph_objs:\n",
      "\n",
      "class Choropleth(plotly.basedatatypes.BaseTraceType)\n",
      " |  Base class for the all trace types.\n",
      " |  \n",
      " |  Specific trace type classes (Scatter, Bar, etc.) are code generated as\n",
      " |  subclasses of this class.\n",
      " |  \n",
      " |  Method resolution order:\n",
      " |      Choropleth\n",
      " |      plotly.basedatatypes.BaseTraceType\n",
      " |      plotly.basedatatypes.BaseTraceHierarchyType\n",
      " |      plotly.basedatatypes.BasePlotlyType\n",
      " |      builtins.object\n",
      " |  \n",
      " |  Methods defined here:\n",
      " |  \n",
      " |  __init__(self, arg=None, autocolorscale=None, coloraxis=None, colorbar=None, colorscale=None, customdata=None, customdatasrc=None, geo=None, hoverinfo=None, hoverinfosrc=None, hoverlabel=None, hovertemplate=None, hovertemplatesrc=None, hovertext=None, hovertextsrc=None, ids=None, idssrc=None, locationmode=None, locations=None, locationssrc=None, marker=None, meta=None, metasrc=None, name=None, reversescale=None, selected=None, selectedpoints=None, showscale=None, stream=None, text=None, textsrc=None, uid=None, uirevision=None, unselected=None, visible=None, z=None, zauto=None, zmax=None, zmid=None, zmin=None, zsrc=None, **kwargs)\n",
      " |      Construct a new Choropleth object\n",
      " |      \n",
      " |      The data that describes the choropleth value-to-color mapping\n",
      " |      is set in `z`. The geographic locations corresponding to each\n",
      " |      value in `z` are set in `locations`.\n",
      " |      \n",
      " |      Parameters\n",
      " |      ----------\n",
      " |      arg\n",
      " |          dict of properties compatible with this constructor or\n",
      " |          an instance of plotly.graph_objs.Choropleth\n",
      " |      autocolorscale\n",
      " |          Determines whether the colorscale is a default palette\n",
      " |          (`autocolorscale: true`) or the palette determined by\n",
      " |          `colorscale`. In case `colorscale` is unspecified or\n",
      " |          `autocolorscale` is true, the default  palette will be\n",
      " |          chosen according to whether numbers in the `color`\n",
      " |          array are all positive, all negative or mixed.\n",
      " |      coloraxis\n",
      " |          Sets a reference to a shared color axis. References to\n",
      " |          these shared color axes are \"coloraxis\", \"coloraxis2\",\n",
      " |          \"coloraxis3\", etc. Settings for these shared color axes\n",
      " |          are set in the layout, under `layout.coloraxis`,\n",
      " |          `layout.coloraxis2`, etc. Note that multiple color\n",
      " |          scales can be linked to the same color axis.\n",
      " |      colorbar\n",
      " |          plotly.graph_objects.choropleth.ColorBar instance or\n",
      " |          dict with compatible properties\n",
      " |      colorscale\n",
      " |          Sets the colorscale. The colorscale must be an array\n",
      " |          containing arrays mapping a normalized value to an rgb,\n",
      " |          rgba, hex, hsl, hsv, or named color string. At minimum,\n",
      " |          a mapping for the lowest (0) and highest (1) values are\n",
      " |          required. For example, `[[0, 'rgb(0,0,255)', [1,\n",
      " |          'rgb(255,0,0)']]`. To control the bounds of the\n",
      " |          colorscale in color space, use`zmin` and `zmax`.\n",
      " |          Alternatively, `colorscale` may be a palette name\n",
      " |          string of the following list: Greys,YlGnBu,Greens,YlOrR\n",
      " |          d,Bluered,RdBu,Reds,Blues,Picnic,Rainbow,Portland,Jet,H\n",
      " |          ot,Blackbody,Earth,Electric,Viridis,Cividis.\n",
      " |      customdata\n",
      " |          Assigns extra data each datum. This may be useful when\n",
      " |          listening to hover, click and selection events. Note\n",
      " |          that, \"scatter\" traces also appends customdata items in\n",
      " |          the markers DOM elements\n",
      " |      customdatasrc\n",
      " |          Sets the source reference on plot.ly for  customdata .\n",
      " |      geo\n",
      " |          Sets a reference between this trace's geospatial\n",
      " |          coordinates and a geographic map. If \"geo\" (the default\n",
      " |          value), the geospatial coordinates refer to\n",
      " |          `layout.geo`. If \"geo2\", the geospatial coordinates\n",
      " |          refer to `layout.geo2`, and so on.\n",
      " |      hoverinfo\n",
      " |          Determines which trace information appear on hover. If\n",
      " |          `none` or `skip` are set, no information is displayed\n",
      " |          upon hovering. But, if `none` is set, click and hover\n",
      " |          events are still fired.\n",
      " |      hoverinfosrc\n",
      " |          Sets the source reference on plot.ly for  hoverinfo .\n",
      " |      hoverlabel\n",
      " |          plotly.graph_objects.choropleth.Hoverlabel instance or\n",
      " |          dict with compatible properties\n",
      " |      hovertemplate\n",
      " |          Template string used for rendering the information that\n",
      " |          appear on hover box. Note that this will override\n",
      " |          `hoverinfo`. Variables are inserted using %{variable},\n",
      " |          for example \"y: %{y}\". Numbers are formatted using\n",
      " |          d3-format's syntax %{variable:d3-format}, for example\n",
      " |          \"Price: %{y:$.2f}\". See https://github.com/d3/d3-format\n",
      " |          /blob/master/README.md#locale_format for details on the\n",
      " |          formatting syntax. The variables available in\n",
      " |          `hovertemplate` are the ones emitted as event data\n",
      " |          described at this link\n",
      " |          https://plot.ly/javascript/plotlyjs-events/#event-data.\n",
      " |          Additionally, every attributes that can be specified\n",
      " |          per-point (the ones that are `arrayOk: true`) are\n",
      " |          available.  Anything contained in tag `<extra>` is\n",
      " |          displayed in the secondary box, for example\n",
      " |          \"<extra>{fullData.name}</extra>\". To hide the secondary\n",
      " |          box completely, use an empty tag `<extra></extra>`.\n",
      " |      hovertemplatesrc\n",
      " |          Sets the source reference on plot.ly for  hovertemplate\n",
      " |          .\n",
      " |      hovertext\n",
      " |          Same as `text`.\n",
      " |      hovertextsrc\n",
      " |          Sets the source reference on plot.ly for  hovertext .\n",
      " |      ids\n",
      " |          Assigns id labels to each datum. These ids for object\n",
      " |          constancy of data points during animation. Should be an\n",
      " |          array of strings, not numbers or any other type.\n",
      " |      idssrc\n",
      " |          Sets the source reference on plot.ly for  ids .\n",
      " |      locationmode\n",
      " |          Determines the set of locations used to match entries\n",
      " |          in `locations` to regions on the map.\n",
      " |      locations\n",
      " |          Sets the coordinates via location IDs or names. See\n",
      " |          `locationmode` for more info.\n",
      " |      locationssrc\n",
      " |          Sets the source reference on plot.ly for  locations .\n",
      " |      marker\n",
      " |          plotly.graph_objects.choropleth.Marker instance or dict\n",
      " |          with compatible properties\n",
      " |      meta\n",
      " |          Assigns extra meta information associated with this\n",
      " |          trace that can be used in various text attributes.\n",
      " |          Attributes such as trace `name`, graph, axis and\n",
      " |          colorbar `title.text`, annotation `text`\n",
      " |          `rangeselector`, `updatemenues` and `sliders` `label`\n",
      " |          text all support `meta`. To access the trace `meta`\n",
      " |          values in an attribute in the same trace, simply use\n",
      " |          `%{meta[i]}` where `i` is the index or key of the\n",
      " |          `meta` item in question. To access trace `meta` in\n",
      " |          layout attributes, use `%{data[n[.meta[i]}` where `i`\n",
      " |          is the index or key of the `meta` and `n` is the trace\n",
      " |          index.\n",
      " |      metasrc\n",
      " |          Sets the source reference on plot.ly for  meta .\n",
      " |      name\n",
      " |          Sets the trace name. The trace name appear as the\n",
      " |          legend item and on hover.\n",
      " |      reversescale\n",
      " |          Reverses the color mapping if true. If true, `zmin`\n",
      " |          will correspond to the last color in the array and\n",
      " |          `zmax` will correspond to the first color.\n",
      " |      selected\n",
      " |          plotly.graph_objects.choropleth.Selected instance or\n",
      " |          dict with compatible properties\n",
      " |      selectedpoints\n",
      " |          Array containing integer indices of selected points.\n",
      " |          Has an effect only for traces that support selections.\n",
      " |          Note that an empty array means an empty selection where\n",
      " |          the `unselected` are turned on for all points, whereas,\n",
      " |          any other non-array values means no selection all where\n",
      " |          the `selected` and `unselected` styles have no effect.\n",
      " |      showscale\n",
      " |          Determines whether or not a colorbar is displayed for\n",
      " |          this trace.\n",
      " |      stream\n",
      " |          plotly.graph_objects.choropleth.Stream instance or dict\n",
      " |          with compatible properties\n",
      " |      text\n",
      " |          Sets the text elements associated with each location.\n",
      " |      textsrc\n",
      " |          Sets the source reference on plot.ly for  text .\n",
      " |      uid\n",
      " |          Assign an id to this trace, Use this to provide object\n",
      " |          constancy between traces during animations and\n",
      " |          transitions.\n",
      " |      uirevision\n",
      " |          Controls persistence of some user-driven changes to the\n",
      " |          trace: `constraintrange` in `parcoords` traces, as well\n",
      " |          as some `editable: true` modifications such as `name`\n",
      " |          and `colorbar.title`. Defaults to `layout.uirevision`.\n",
      " |          Note that other user-driven trace attribute changes are\n",
      " |          controlled by `layout` attributes: `trace.visible` is\n",
      " |          controlled by `layout.legend.uirevision`,\n",
      " |          `selectedpoints` is controlled by\n",
      " |          `layout.selectionrevision`, and `colorbar.(x|y)`\n",
      " |          (accessible with `config: {editable: true}`) is\n",
      " |          controlled by `layout.editrevision`. Trace changes are\n",
      " |          tracked by `uid`, which only falls back on trace index\n",
      " |          if no `uid` is provided. So if your app can add/remove\n",
      " |          traces before the end of the `data` array, such that\n",
      " |          the same trace has a different index, you can still\n",
      " |          preserve user-driven changes if you give each trace a\n",
      " |          `uid` that stays with it as it moves.\n",
      " |      unselected\n",
      " |          plotly.graph_objects.choropleth.Unselected instance or\n",
      " |          dict with compatible properties\n",
      " |      visible\n",
      " |          Determines whether or not this trace is visible. If\n",
      " |          \"legendonly\", the trace is not drawn, but can appear as\n",
      " |          a legend item (provided that the legend itself is\n",
      " |          visible).\n",
      " |      z\n",
      " |          Sets the color values.\n",
      " |      zauto\n",
      " |          Determines whether or not the color domain is computed\n",
      " |          with respect to the input data (here in `z`) or the\n",
      " |          bounds set in `zmin` and `zmax`  Defaults to `false`\n",
      " |          when `zmin` and `zmax` are set by the user.\n",
      " |      zmax\n",
      " |          Sets the upper bound of the color domain. Value should\n",
      " |          have the same units as in `z` and if set, `zmin` must\n",
      " |          be set as well.\n",
      " |      zmid\n",
      " |          Sets the mid-point of the color domain by scaling\n",
      " |          `zmin` and/or `zmax` to be equidistant to this point.\n",
      " |          Value should have the same units as in `z`. Has no\n",
      " |          effect when `zauto` is `false`.\n",
      " |      zmin\n",
      " |          Sets the lower bound of the color domain. Value should\n",
      " |          have the same units as in `z` and if set, `zmax` must\n",
      " |          be set as well.\n",
      " |      zsrc\n",
      " |          Sets the source reference on plot.ly for  z .\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      Choropleth\n",
      " |  \n",
      " |  ----------------------------------------------------------------------\n",
      " |  Data descriptors defined here:\n",
      " |  \n",
      " |  autocolorscale\n",
      " |      Determines whether the colorscale is a default palette\n",
      " |      (`autocolorscale: true`) or the palette determined by\n",
      " |      `colorscale`. In case `colorscale` is unspecified or\n",
      " |      `autocolorscale` is true, the default  palette will be chosen\n",
      " |      according to whether numbers in the `color` array are all\n",
      " |      positive, all negative or mixed.\n",
      " |      \n",
      " |      The 'autocolorscale' property must be specified as a bool\n",
      " |      (either True, or False)\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      bool\n",
      " |  \n",
      " |  coloraxis\n",
      " |      Sets a reference to a shared color axis. References to these\n",
      " |      shared color axes are \"coloraxis\", \"coloraxis2\", \"coloraxis3\",\n",
      " |      etc. Settings for these shared color axes are set in the\n",
      " |      layout, under `layout.coloraxis`, `layout.coloraxis2`, etc.\n",
      " |      Note that multiple color scales can be linked to the same color\n",
      " |      axis.\n",
      " |      \n",
      " |      The 'coloraxis' property is an identifier of a particular\n",
      " |      subplot, of type 'coloraxis', that may be specified as the string 'coloraxis'\n",
      " |      optionally followed by an integer >= 1\n",
      " |      (e.g. 'coloraxis', 'coloraxis1', 'coloraxis2', 'coloraxis3', etc.)\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      str\n",
      " |  \n",
      " |  colorbar\n",
      " |      The 'colorbar' property is an instance of ColorBar\n",
      " |      that may be specified as:\n",
      " |        - An instance of plotly.graph_objs.choropleth.ColorBar\n",
      " |        - A dict of string/value properties that will be passed\n",
      " |          to the ColorBar constructor\n",
      " |      \n",
      " |          Supported dict properties:\n",
      " |              \n",
      " |              bgcolor\n",
      " |                  Sets the color of padded area.\n",
      " |              bordercolor\n",
      " |                  Sets the axis line color.\n",
      " |              borderwidth\n",
      " |                  Sets the width (in px) or the border enclosing\n",
      " |                  this color bar.\n",
      " |              dtick\n",
      " |                  Sets the step in-between ticks on this axis.\n",
      " |                  Use with `tick0`. Must be a positive number, or\n",
      " |                  special strings available to \"log\" and \"date\"\n",
      " |                  axes. If the axis `type` is \"log\", then ticks\n",
      " |                  are set every 10^(n*dtick) where n is the tick\n",
      " |                  number. For example, to set a tick mark at 1,\n",
      " |                  10, 100, 1000, ... set dtick to 1. To set tick\n",
      " |                  marks at 1, 100, 10000, ... set dtick to 2. To\n",
      " |                  set tick marks at 1, 5, 25, 125, 625, 3125, ...\n",
      " |                  set dtick to log_10(5), or 0.69897000433. \"log\"\n",
      " |                  has several special values; \"L<f>\", where `f`\n",
      " |                  is a positive number, gives ticks linearly\n",
      " |                  spaced in value (but not position). For example\n",
      " |                  `tick0` = 0.1, `dtick` = \"L0.5\" will put ticks\n",
      " |                  at 0.1, 0.6, 1.1, 1.6 etc. To show powers of 10\n",
      " |                  plus small digits between, use \"D1\" (all\n",
      " |                  digits) or \"D2\" (only 2 and 5). `tick0` is\n",
      " |                  ignored for \"D1\" and \"D2\". If the axis `type`\n",
      " |                  is \"date\", then you must convert the time to\n",
      " |                  milliseconds. For example, to set the interval\n",
      " |                  between ticks to one day, set `dtick` to\n",
      " |                  86400000.0. \"date\" also has special values\n",
      " |                  \"M<n>\" gives ticks spaced by a number of\n",
      " |                  months. `n` must be a positive integer. To set\n",
      " |                  ticks on the 15th of every third month, set\n",
      " |                  `tick0` to \"2000-01-15\" and `dtick` to \"M3\". To\n",
      " |                  set ticks every 4 years, set `dtick` to \"M48\"\n",
      " |              exponentformat\n",
      " |                  Determines a formatting rule for the tick\n",
      " |                  exponents. For example, consider the number\n",
      " |                  1,000,000,000. If \"none\", it appears as\n",
      " |                  1,000,000,000. If \"e\", 1e+9. If \"E\", 1E+9. If\n",
      " |                  \"power\", 1x10^9 (with 9 in a super script). If\n",
      " |                  \"SI\", 1G. If \"B\", 1B.\n",
      " |              len\n",
      " |                  Sets the length of the color bar This measure\n",
      " |                  excludes the padding of both ends. That is, the\n",
      " |                  color bar length is this length minus the\n",
      " |                  padding on both ends.\n",
      " |              lenmode\n",
      " |                  Determines whether this color bar's length\n",
      " |                  (i.e. the measure in the color variation\n",
      " |                  direction) is set in units of plot \"fraction\"\n",
      " |                  or in *pixels. Use `len` to set the value.\n",
      " |              nticks\n",
      " |                  Specifies the maximum number of ticks for the\n",
      " |                  particular axis. The actual number of ticks\n",
      " |                  will be chosen automatically to be less than or\n",
      " |                  equal to `nticks`. Has an effect only if\n",
      " |                  `tickmode` is set to \"auto\".\n",
      " |              outlinecolor\n",
      " |                  Sets the axis line color.\n",
      " |              outlinewidth\n",
      " |                  Sets the width (in px) of the axis line.\n",
      " |              separatethousands\n",
      " |                  If \"true\", even 4-digit integers are separated\n",
      " |              showexponent\n",
      " |                  If \"all\", all exponents are shown besides their\n",
      " |                  significands. If \"first\", only the exponent of\n",
      " |                  the first tick is shown. If \"last\", only the\n",
      " |                  exponent of the last tick is shown. If \"none\",\n",
      " |                  no exponents appear.\n",
      " |              showticklabels\n",
      " |                  Determines whether or not the tick labels are\n",
      " |                  drawn.\n",
      " |              showtickprefix\n",
      " |                  If \"all\", all tick labels are displayed with a\n",
      " |                  prefix. If \"first\", only the first tick is\n",
      " |                  displayed with a prefix. If \"last\", only the\n",
      " |                  last tick is displayed with a suffix. If\n",
      " |                  \"none\", tick prefixes are hidden.\n",
      " |              showticksuffix\n",
      " |                  Same as `showtickprefix` but for tick suffixes.\n",
      " |              thickness\n",
      " |                  Sets the thickness of the color bar This\n",
      " |                  measure excludes the size of the padding, ticks\n",
      " |                  and labels.\n",
      " |              thicknessmode\n",
      " |                  Determines whether this color bar's thickness\n",
      " |                  (i.e. the measure in the constant color\n",
      " |                  direction) is set in units of plot \"fraction\"\n",
      " |                  or in \"pixels\". Use `thickness` to set the\n",
      " |                  value.\n",
      " |              tick0\n",
      " |                  Sets the placement of the first tick on this\n",
      " |                  axis. Use with `dtick`. If the axis `type` is\n",
      " |                  \"log\", then you must take the log of your\n",
      " |                  starting tick (e.g. to set the starting tick to\n",
      " |                  100, set the `tick0` to 2) except when\n",
      " |                  `dtick`=*L<f>* (see `dtick` for more info). If\n",
      " |                  the axis `type` is \"date\", it should be a date\n",
      " |                  string, like date data. If the axis `type` is\n",
      " |                  \"category\", it should be a number, using the\n",
      " |                  scale where each category is assigned a serial\n",
      " |                  number from zero in the order it appears.\n",
      " |              tickangle\n",
      " |                  Sets the angle of the tick labels with respect\n",
      " |                  to the horizontal. For example, a `tickangle`\n",
      " |                  of -90 draws the tick labels vertically.\n",
      " |              tickcolor\n",
      " |                  Sets the tick color.\n",
      " |              tickfont\n",
      " |                  Sets the color bar's tick label font\n",
      " |              tickformat\n",
      " |                  Sets the tick label formatting rule using d3\n",
      " |                  formatting mini-languages which are very\n",
      " |                  similar to those in Python. For numbers, see: h\n",
      " |                  ttps://github.com/d3/d3-format/blob/master/READ\n",
      " |                  ME.md#locale_format And for dates see:\n",
      " |                  https://github.com/d3/d3-time-\n",
      " |                  format/blob/master/README.md#locale_format We\n",
      " |                  add one item to d3's date formatter: \"%{n}f\"\n",
      " |                  for fractional seconds with n digits. For\n",
      " |                  example, *2016-10-13 09:15:23.456* with\n",
      " |                  tickformat \"%H~%M~%S.%2f\" would display\n",
      " |                  \"09~15~23.46\"\n",
      " |              tickformatstops\n",
      " |                  A tuple of plotly.graph_objects.choropleth.colo\n",
      " |                  rbar.Tickformatstop instances or dicts with\n",
      " |                  compatible properties\n",
      " |              tickformatstopdefaults\n",
      " |                  When used in a template (as layout.template.dat\n",
      " |                  a.choropleth.colorbar.tickformatstopdefaults),\n",
      " |                  sets the default property values to use for\n",
      " |                  elements of choropleth.colorbar.tickformatstops\n",
      " |              ticklen\n",
      " |                  Sets the tick length (in px).\n",
      " |              tickmode\n",
      " |                  Sets the tick mode for this axis. If \"auto\",\n",
      " |                  the number of ticks is set via `nticks`. If\n",
      " |                  \"linear\", the placement of the ticks is\n",
      " |                  determined by a starting position `tick0` and a\n",
      " |                  tick step `dtick` (\"linear\" is the default\n",
      " |                  value if `tick0` and `dtick` are provided). If\n",
      " |                  \"array\", the placement of the ticks is set via\n",
      " |                  `tickvals` and the tick text is `ticktext`.\n",
      " |                  (\"array\" is the default value if `tickvals` is\n",
      " |                  provided).\n",
      " |              tickprefix\n",
      " |                  Sets a tick label prefix.\n",
      " |              ticks\n",
      " |                  Determines whether ticks are drawn or not. If\n",
      " |                  \"\", this axis' ticks are not drawn. If\n",
      " |                  \"outside\" (\"inside\"), this axis' are drawn\n",
      " |                  outside (inside) the axis lines.\n",
      " |              ticksuffix\n",
      " |                  Sets a tick label suffix.\n",
      " |              ticktext\n",
      " |                  Sets the text displayed at the ticks position\n",
      " |                  via `tickvals`. Only has an effect if\n",
      " |                  `tickmode` is set to \"array\". Used with\n",
      " |                  `tickvals`.\n",
      " |              ticktextsrc\n",
      " |                  Sets the source reference on plot.ly for\n",
      " |                  ticktext .\n",
      " |              tickvals\n",
      " |                  Sets the values at which ticks on this axis\n",
      " |                  appear. Only has an effect if `tickmode` is set\n",
      " |                  to \"array\". Used with `ticktext`.\n",
      " |              tickvalssrc\n",
      " |                  Sets the source reference on plot.ly for\n",
      " |                  tickvals .\n",
      " |              tickwidth\n",
      " |                  Sets the tick width (in px).\n",
      " |              title\n",
      " |                  plotly.graph_objects.choropleth.colorbar.Title\n",
      " |                  instance or dict with compatible properties\n",
      " |              titlefont\n",
      " |                  Deprecated: Please use\n",
      " |                  choropleth.colorbar.title.font instead. Sets\n",
      " |                  this color bar's title font. Note that the\n",
      " |                  title's font used to be set by the now\n",
      " |                  deprecated `titlefont` attribute.\n",
      " |              titleside\n",
      " |                  Deprecated: Please use\n",
      " |                  choropleth.colorbar.title.side instead.\n",
      " |                  Determines the location of color bar's title\n",
      " |                  with respect to the color bar. Note that the\n",
      " |                  title's location used to be set by the now\n",
      " |                  deprecated `titleside` attribute.\n",
      " |              x\n",
      " |                  Sets the x position of the color bar (in plot\n",
      " |                  fraction).\n",
      " |              xanchor\n",
      " |                  Sets this color bar's horizontal position\n",
      " |                  anchor. This anchor binds the `x` position to\n",
      " |                  the \"left\", \"center\" or \"right\" of the color\n",
      " |                  bar.\n",
      " |              xpad\n",
      " |                  Sets the amount of padding (in px) along the x\n",
      " |                  direction.\n",
      " |              y\n",
      " |                  Sets the y position of the color bar (in plot\n",
      " |                  fraction).\n",
      " |              yanchor\n",
      " |                  Sets this color bar's vertical position anchor\n",
      " |                  This anchor binds the `y` position to the\n",
      " |                  \"top\", \"middle\" or \"bottom\" of the color bar.\n",
      " |              ypad\n",
      " |                  Sets the amount of padding (in px) along the y\n",
      " |                  direction.\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      plotly.graph_objs.choropleth.ColorBar\n",
      " |  \n",
      " |  colorscale\n",
      " |      Sets the colorscale. The colorscale must be an array containing\n",
      " |      arrays mapping a normalized value to an rgb, rgba, hex, hsl,\n",
      " |      hsv, or named color string. At minimum, a mapping for the\n",
      " |      lowest (0) and highest (1) values are required. For example,\n",
      " |      `[[0, 'rgb(0,0,255)', [1, 'rgb(255,0,0)']]`. To control the\n",
      " |      bounds of the colorscale in color space, use`zmin` and `zmax`.\n",
      " |      Alternatively, `colorscale` may be a palette name string of the\n",
      " |      following list: Greys,YlGnBu,Greens,YlOrRd,Bluered,RdBu,Reds,Bl\n",
      " |      ues,Picnic,Rainbow,Portland,Jet,Hot,Blackbody,Earth,Electric,Vi\n",
      " |      ridis,Cividis.\n",
      " |      \n",
      " |      The 'colorscale' property is a colorscale and may be\n",
      " |      specified as:\n",
      " |        - A list of colors that will be spaced evenly to create the colorscale.\n",
      " |          Many predefined colorscale lists are included in the sequential, diverging,\n",
      " |          and cyclical modules in the plotly.colors package.\n",
      " |        - A list of 2-element lists where the first element is the\n",
      " |          normalized color level value (starting at 0 and ending at 1), \n",
      " |          and the second item is a valid color string.\n",
      " |          (e.g. [[0, 'green'], [0.5, 'red'], [1.0, 'rgb(0, 0, 255)']])\n",
      " |        - One of the following named colorscales:\n",
      " |              ['aggrnyl', 'agsunset', 'algae', 'amp', 'armyrose', 'balance',\n",
      " |               'blackbody', 'bluered', 'blues', 'blugrn', 'bluyl', 'brbg',\n",
      " |               'brwnyl', 'bugn', 'bupu', 'burg', 'burgyl', 'cividis', 'curl',\n",
      " |               'darkmint', 'deep', 'delta', 'dense', 'earth', 'edge', 'electric',\n",
      " |               'emrld', 'fall', 'geyser', 'gnbu', 'gray', 'greens', 'greys',\n",
      " |               'haline', 'hot', 'hsv', 'ice', 'icefire', 'inferno', 'jet',\n",
      " |               'magenta', 'magma', 'matter', 'mint', 'mrybm', 'mygbm', 'oranges',\n",
      " |               'orrd', 'oryel', 'peach', 'phase', 'picnic', 'pinkyl', 'piyg',\n",
      " |               'plasma', 'plotly3', 'portland', 'prgn', 'pubu', 'pubugn', 'puor',\n",
      " |               'purd', 'purp', 'purples', 'purpor', 'rainbow', 'rdbu', 'rdgy',\n",
      " |               'rdpu', 'rdylbu', 'rdylgn', 'redor', 'reds', 'solar', 'spectral',\n",
      " |               'speed', 'sunset', 'sunsetdark', 'teal', 'tealgrn', 'tealrose',\n",
      " |               'tempo', 'temps', 'thermal', 'tropic', 'turbid', 'twilight',\n",
      " |               'viridis', 'ylgn', 'ylgnbu', 'ylorbr', 'ylorrd']\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      str\n",
      " |  \n",
      " |  customdata\n",
      " |      Assigns extra data each datum. This may be useful when\n",
      " |      listening to hover, click and selection events. Note that,\n",
      " |      \"scatter\" traces also appends customdata items in the markers\n",
      " |      DOM elements\n",
      " |      \n",
      " |      The 'customdata' property is an array that may be specified as a tuple,\n",
      " |      list, numpy array, or pandas Series\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      numpy.ndarray\n",
      " |  \n",
      " |  customdatasrc\n",
      " |      Sets the source reference on plot.ly for  customdata .\n",
      " |      \n",
      " |      The 'customdatasrc' property must be specified as a string or\n",
      " |      as a plotly.grid_objs.Column object\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      str\n",
      " |  \n",
      " |  geo\n",
      " |      Sets a reference between this trace's geospatial coordinates\n",
      " |      and a geographic map. If \"geo\" (the default value), the\n",
      " |      geospatial coordinates refer to `layout.geo`. If \"geo2\", the\n",
      " |      geospatial coordinates refer to `layout.geo2`, and so on.\n",
      " |      \n",
      " |      The 'geo' property is an identifier of a particular\n",
      " |      subplot, of type 'geo', that may be specified as the string 'geo'\n",
      " |      optionally followed by an integer >= 1\n",
      " |      (e.g. 'geo', 'geo1', 'geo2', 'geo3', etc.)\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      str\n",
      " |  \n",
      " |  hoverinfo\n",
      " |      Determines which trace information appear on hover. If `none`\n",
      " |      or `skip` are set, no information is displayed upon hovering.\n",
      " |      But, if `none` is set, click and hover events are still fired.\n",
      " |      \n",
      " |      The 'hoverinfo' property is a flaglist and may be specified\n",
      " |      as a string containing:\n",
      " |        - Any combination of ['location', 'z', 'text', 'name'] joined with '+' characters\n",
      " |          (e.g. 'location+z')\n",
      " |          OR exactly one of ['all', 'none', 'skip'] (e.g. 'skip')\n",
      " |        - A list or array of the above\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      Any|numpy.ndarray\n",
      " |  \n",
      " |  hoverinfosrc\n",
      " |      Sets the source reference on plot.ly for  hoverinfo .\n",
      " |      \n",
      " |      The 'hoverinfosrc' property must be specified as a string or\n",
      " |      as a plotly.grid_objs.Column object\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      str\n",
      " |  \n",
      " |  hoverlabel\n",
      " |      The 'hoverlabel' property is an instance of Hoverlabel\n",
      " |      that may be specified as:\n",
      " |        - An instance of plotly.graph_objs.choropleth.Hoverlabel\n",
      " |        - A dict of string/value properties that will be passed\n",
      " |          to the Hoverlabel constructor\n",
      " |      \n",
      " |          Supported dict properties:\n",
      " |              \n",
      " |              align\n",
      " |                  Sets the horizontal alignment of the text\n",
      " |                  content within hover label box. Has an effect\n",
      " |                  only if the hover label text spans more two or\n",
      " |                  more lines\n",
      " |              alignsrc\n",
      " |                  Sets the source reference on plot.ly for  align\n",
      " |                  .\n",
      " |              bgcolor\n",
      " |                  Sets the background color of the hover labels\n",
      " |                  for this trace\n",
      " |              bgcolorsrc\n",
      " |                  Sets the source reference on plot.ly for\n",
      " |                  bgcolor .\n",
      " |              bordercolor\n",
      " |                  Sets the border color of the hover labels for\n",
      " |                  this trace.\n",
      " |              bordercolorsrc\n",
      " |                  Sets the source reference on plot.ly for\n",
      " |                  bordercolor .\n",
      " |              font\n",
      " |                  Sets the font used in hover labels.\n",
      " |              namelength\n",
      " |                  Sets the default length (in number of\n",
      " |                  characters) of the trace name in the hover\n",
      " |                  labels for all traces. -1 shows the whole name\n",
      " |                  regardless of length. 0-3 shows the first 0-3\n",
      " |                  characters, and an integer >3 will show the\n",
      " |                  whole name if it is less than that many\n",
      " |                  characters, but if it is longer, will truncate\n",
      " |                  to `namelength - 3` characters and add an\n",
      " |                  ellipsis.\n",
      " |              namelengthsrc\n",
      " |                  Sets the source reference on plot.ly for\n",
      " |                  namelength .\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      plotly.graph_objs.choropleth.Hoverlabel\n",
      " |  \n",
      " |  hovertemplate\n",
      " |      Template string used for rendering the information that appear\n",
      " |      on hover box. Note that this will override `hoverinfo`.\n",
      " |      Variables are inserted using %{variable}, for example \"y:\n",
      " |      %{y}\". Numbers are formatted using d3-format's syntax\n",
      " |      %{variable:d3-format}, for example \"Price: %{y:$.2f}\". See http\n",
      " |      s://github.com/d3/d3-format/blob/master/README.md#locale_format\n",
      " |      for details on the formatting syntax. The variables available\n",
      " |      in `hovertemplate` are the ones emitted as event data described\n",
      " |      at this link https://plot.ly/javascript/plotlyjs-events/#event-\n",
      " |      data. Additionally, every attributes that can be specified per-\n",
      " |      point (the ones that are `arrayOk: true`) are available.\n",
      " |      Anything contained in tag `<extra>` is displayed in the\n",
      " |      secondary box, for example \"<extra>{fullData.name}</extra>\". To\n",
      " |      hide the secondary box completely, use an empty tag\n",
      " |      `<extra></extra>`.\n",
      " |      \n",
      " |      The 'hovertemplate' property is a string and must be specified as:\n",
      " |        - A string\n",
      " |        - A number that will be converted to a string\n",
      " |        - A tuple, list, or one-dimensional numpy array of the above\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      str|numpy.ndarray\n",
      " |  \n",
      " |  hovertemplatesrc\n",
      " |      Sets the source reference on plot.ly for  hovertemplate .\n",
      " |      \n",
      " |      The 'hovertemplatesrc' property must be specified as a string or\n",
      " |      as a plotly.grid_objs.Column object\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      str\n",
      " |  \n",
      " |  hovertext\n",
      " |      Same as `text`.\n",
      " |      \n",
      " |      The 'hovertext' property is a string and must be specified as:\n",
      " |        - A string\n",
      " |        - A number that will be converted to a string\n",
      " |        - A tuple, list, or one-dimensional numpy array of the above\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      str|numpy.ndarray\n",
      " |  \n",
      " |  hovertextsrc\n",
      " |      Sets the source reference on plot.ly for  hovertext .\n",
      " |      \n",
      " |      The 'hovertextsrc' property must be specified as a string or\n",
      " |      as a plotly.grid_objs.Column object\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      str\n",
      " |  \n",
      " |  ids\n",
      " |      Assigns id labels to each datum. These ids for object constancy\n",
      " |      of data points during animation. Should be an array of strings,\n",
      " |      not numbers or any other type.\n",
      " |      \n",
      " |      The 'ids' property is an array that may be specified as a tuple,\n",
      " |      list, numpy array, or pandas Series\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      numpy.ndarray\n",
      " |  \n",
      " |  idssrc\n",
      " |      Sets the source reference on plot.ly for  ids .\n",
      " |      \n",
      " |      The 'idssrc' property must be specified as a string or\n",
      " |      as a plotly.grid_objs.Column object\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      str\n",
      " |  \n",
      " |  locationmode\n",
      " |      Determines the set of locations used to match entries in\n",
      " |      `locations` to regions on the map.\n",
      " |      \n",
      " |      The 'locationmode' property is an enumeration that may be specified as:\n",
      " |        - One of the following enumeration values:\n",
      " |              ['ISO-3', 'USA-states', 'country names']\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      Any\n",
      " |  \n",
      " |  locations\n",
      " |      Sets the coordinates via location IDs or names. See\n",
      " |      `locationmode` for more info.\n",
      " |      \n",
      " |      The 'locations' property is an array that may be specified as a tuple,\n",
      " |      list, numpy array, or pandas Series\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      numpy.ndarray\n",
      " |  \n",
      " |  locationssrc\n",
      " |      Sets the source reference on plot.ly for  locations .\n",
      " |      \n",
      " |      The 'locationssrc' property must be specified as a string or\n",
      " |      as a plotly.grid_objs.Column object\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      str\n",
      " |  \n",
      " |  marker\n",
      " |      The 'marker' property is an instance of Marker\n",
      " |      that may be specified as:\n",
      " |        - An instance of plotly.graph_objs.choropleth.Marker\n",
      " |        - A dict of string/value properties that will be passed\n",
      " |          to the Marker constructor\n",
      " |      \n",
      " |          Supported dict properties:\n",
      " |              \n",
      " |              line\n",
      " |                  plotly.graph_objects.choropleth.marker.Line\n",
      " |                  instance or dict with compatible properties\n",
      " |              opacity\n",
      " |                  Sets the opacity of the locations.\n",
      " |              opacitysrc\n",
      " |                  Sets the source reference on plot.ly for\n",
      " |                  opacity .\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      plotly.graph_objs.choropleth.Marker\n",
      " |  \n",
      " |  meta\n",
      " |      Assigns extra meta information associated with this trace that\n",
      " |      can be used in various text attributes. Attributes such as\n",
      " |      trace `name`, graph, axis and colorbar `title.text`, annotation\n",
      " |      `text` `rangeselector`, `updatemenues` and `sliders` `label`\n",
      " |      text all support `meta`. To access the trace `meta` values in\n",
      " |      an attribute in the same trace, simply use `%{meta[i]}` where\n",
      " |      `i` is the index or key of the `meta` item in question. To\n",
      " |      access trace `meta` in layout attributes, use\n",
      " |      `%{data[n[.meta[i]}` where `i` is the index or key of the\n",
      " |      `meta` and `n` is the trace index.\n",
      " |      \n",
      " |      The 'meta' property accepts values of any type\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      Any|numpy.ndarray\n",
      " |  \n",
      " |  metasrc\n",
      " |      Sets the source reference on plot.ly for  meta .\n",
      " |      \n",
      " |      The 'metasrc' property must be specified as a string or\n",
      " |      as a plotly.grid_objs.Column object\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      str\n",
      " |  \n",
      " |  name\n",
      " |      Sets the trace name. The trace name appear as the legend item\n",
      " |      and on hover.\n",
      " |      \n",
      " |      The 'name' property is a string and must be specified as:\n",
      " |        - A string\n",
      " |        - A number that will be converted to a string\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      str\n",
      " |  \n",
      " |  reversescale\n",
      " |      Reverses the color mapping if true. If true, `zmin` will\n",
      " |      correspond to the last color in the array and `zmax` will\n",
      " |      correspond to the first color.\n",
      " |      \n",
      " |      The 'reversescale' property must be specified as a bool\n",
      " |      (either True, or False)\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      bool\n",
      " |  \n",
      " |  selected\n",
      " |      The 'selected' property is an instance of Selected\n",
      " |      that may be specified as:\n",
      " |        - An instance of plotly.graph_objs.choropleth.Selected\n",
      " |        - A dict of string/value properties that will be passed\n",
      " |          to the Selected constructor\n",
      " |      \n",
      " |          Supported dict properties:\n",
      " |              \n",
      " |              marker\n",
      " |                  plotly.graph_objects.choropleth.selected.Marker\n",
      " |                  instance or dict with compatible properties\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      plotly.graph_objs.choropleth.Selected\n",
      " |  \n",
      " |  selectedpoints\n",
      " |      Array containing integer indices of selected points. Has an\n",
      " |      effect only for traces that support selections. Note that an\n",
      " |      empty array means an empty selection where the `unselected` are\n",
      " |      turned on for all points, whereas, any other non-array values\n",
      " |      means no selection all where the `selected` and `unselected`\n",
      " |      styles have no effect.\n",
      " |      \n",
      " |      The 'selectedpoints' property accepts values of any type\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      Any\n",
      " |  \n",
      " |  showscale\n",
      " |      Determines whether or not a colorbar is displayed for this\n",
      " |      trace.\n",
      " |      \n",
      " |      The 'showscale' property must be specified as a bool\n",
      " |      (either True, or False)\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      bool\n",
      " |  \n",
      " |  stream\n",
      " |      The 'stream' property is an instance of Stream\n",
      " |      that may be specified as:\n",
      " |        - An instance of plotly.graph_objs.choropleth.Stream\n",
      " |        - A dict of string/value properties that will be passed\n",
      " |          to the Stream constructor\n",
      " |      \n",
      " |          Supported dict properties:\n",
      " |              \n",
      " |              maxpoints\n",
      " |                  Sets the maximum number of points to keep on\n",
      " |                  the plots from an incoming stream. If\n",
      " |                  `maxpoints` is set to 50, only the newest 50\n",
      " |                  points will be displayed on the plot.\n",
      " |              token\n",
      " |                  The stream id number links a data trace on a\n",
      " |                  plot with a stream. See\n",
      " |                  https://plot.ly/settings for more details.\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      plotly.graph_objs.choropleth.Stream\n",
      " |  \n",
      " |  text\n",
      " |      Sets the text elements associated with each location.\n",
      " |      \n",
      " |      The 'text' property is a string and must be specified as:\n",
      " |        - A string\n",
      " |        - A number that will be converted to a string\n",
      " |        - A tuple, list, or one-dimensional numpy array of the above\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      str|numpy.ndarray\n",
      " |  \n",
      " |  textsrc\n",
      " |      Sets the source reference on plot.ly for  text .\n",
      " |      \n",
      " |      The 'textsrc' property must be specified as a string or\n",
      " |      as a plotly.grid_objs.Column object\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      str\n",
      " |  \n",
      " |  type\n",
      " |  \n",
      " |  uid\n",
      " |      Assign an id to this trace, Use this to provide object\n",
      " |      constancy between traces during animations and transitions.\n",
      " |      \n",
      " |      The 'uid' property is a string and must be specified as:\n",
      " |        - A string\n",
      " |        - A number that will be converted to a string\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      str\n",
      " |  \n",
      " |  uirevision\n",
      " |      Controls persistence of some user-driven changes to the trace:\n",
      " |      `constraintrange` in `parcoords` traces, as well as some\n",
      " |      `editable: true` modifications such as `name` and\n",
      " |      `colorbar.title`. Defaults to `layout.uirevision`. Note that\n",
      " |      other user-driven trace attribute changes are controlled by\n",
      " |      `layout` attributes: `trace.visible` is controlled by\n",
      " |      `layout.legend.uirevision`, `selectedpoints` is controlled by\n",
      " |      `layout.selectionrevision`, and `colorbar.(x|y)` (accessible\n",
      " |      with `config: {editable: true}`) is controlled by\n",
      " |      `layout.editrevision`. Trace changes are tracked by `uid`,\n",
      " |      which only falls back on trace index if no `uid` is provided.\n",
      " |      So if your app can add/remove traces before the end of the\n",
      " |      `data` array, such that the same trace has a different index,\n",
      " |      you can still preserve user-driven changes if you give each\n",
      " |      trace a `uid` that stays with it as it moves.\n",
      " |      \n",
      " |      The 'uirevision' property accepts values of any type\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      Any\n",
      " |  \n",
      " |  unselected\n",
      " |      The 'unselected' property is an instance of Unselected\n",
      " |      that may be specified as:\n",
      " |        - An instance of plotly.graph_objs.choropleth.Unselected\n",
      " |        - A dict of string/value properties that will be passed\n",
      " |          to the Unselected constructor\n",
      " |      \n",
      " |          Supported dict properties:\n",
      " |              \n",
      " |              marker\n",
      " |                  plotly.graph_objects.choropleth.unselected.Mark\n",
      " |                  er instance or dict with compatible properties\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      plotly.graph_objs.choropleth.Unselected\n",
      " |  \n",
      " |  visible\n",
      " |      Determines whether or not this trace is visible. If\n",
      " |      \"legendonly\", the trace is not drawn, but can appear as a\n",
      " |      legend item (provided that the legend itself is visible).\n",
      " |      \n",
      " |      The 'visible' property is an enumeration that may be specified as:\n",
      " |        - One of the following enumeration values:\n",
      " |              [True, False, 'legendonly']\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      Any\n",
      " |  \n",
      " |  z\n",
      " |      Sets the color values.\n",
      " |      \n",
      " |      The 'z' property is an array that may be specified as a tuple,\n",
      " |      list, numpy array, or pandas Series\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      numpy.ndarray\n",
      " |  \n",
      " |  zauto\n",
      " |      Determines whether or not the color domain is computed with\n",
      " |      respect to the input data (here in `z`) or the bounds set in\n",
      " |      `zmin` and `zmax`  Defaults to `false` when `zmin` and `zmax`\n",
      " |      are set by the user.\n",
      " |      \n",
      " |      The 'zauto' property must be specified as a bool\n",
      " |      (either True, or False)\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      bool\n",
      " |  \n",
      " |  zmax\n",
      " |      Sets the upper bound of the color domain. Value should have the\n",
      " |      same units as in `z` and if set, `zmin` must be set as well.\n",
      " |      \n",
      " |      The 'zmax' property is a number and may be specified as:\n",
      " |        - An int or float\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      int|float\n",
      " |  \n",
      " |  zmid\n",
      " |      Sets the mid-point of the color domain by scaling `zmin` and/or\n",
      " |      `zmax` to be equidistant to this point. Value should have the\n",
      " |      same units as in `z`. Has no effect when `zauto` is `false`.\n",
      " |      \n",
      " |      The 'zmid' property is a number and may be specified as:\n",
      " |        - An int or float\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      int|float\n",
      " |  \n",
      " |  zmin\n",
      " |      Sets the lower bound of the color domain. Value should have the\n",
      " |      same units as in `z` and if set, `zmax` must be set as well.\n",
      " |      \n",
      " |      The 'zmin' property is a number and may be specified as:\n",
      " |        - An int or float\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      int|float\n",
      " |  \n",
      " |  zsrc\n",
      " |      Sets the source reference on plot.ly for  z .\n",
      " |      \n",
      " |      The 'zsrc' property must be specified as a string or\n",
      " |      as a plotly.grid_objs.Column object\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      str\n",
      " |  \n",
      " |  ----------------------------------------------------------------------\n",
      " |  Methods inherited from plotly.basedatatypes.BaseTraceType:\n",
      " |  \n",
      " |  on_click(self, callback, append=False)\n",
      " |      Register function to be called when the user clicks on one or more\n",
      " |      points in this trace.\n",
      " |      \n",
      " |      Note: Callbacks will only be triggered when the trace belongs to a\n",
      " |      instance of plotly.graph_objs.FigureWidget and it is displayed in an\n",
      " |      ipywidget context. Callbacks will not be triggered on figures\n",
      " |      that are displayed using plot/iplot.\n",
      " |      \n",
      " |      Parameters\n",
      " |      ----------\n",
      " |      callback\n",
      " |          Callable function that accepts 3 arguments\n",
      " |      \n",
      " |          - this trace\n",
      " |          - plotly.callbacks.Points object\n",
      " |          - plotly.callbacks.InputDeviceState object\n",
      " |      \n",
      " |      append : bool\n",
      " |          If False (the default), this callback replaces any previously\n",
      " |          defined on_click callbacks for this trace. If True,\n",
      " |          this callback is appended to the list of any previously defined\n",
      " |          callbacks.\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      None\n",
      " |      \n",
      " |      Examples\n",
      " |      --------\n",
      " |      >>> from plotly.callbacks import Points, InputDeviceState\n",
      " |      >>> points, state = Points(), InputDeviceState()\n",
      " |      \n",
      " |      >>> def click_fn(trace, points, state):\n",
      " |      ...     inds = points.point_inds\n",
      " |      ...     # Do something\n",
      " |      \n",
      " |      >>> trace.on_click(click_fn)\n",
      " |      \n",
      " |      Note: The creation of the `points` and `state` objects is optional,\n",
      " |      it's simply a convenience to help the text editor perform completion\n",
      " |      on the arguments inside `click_fn`\n",
      " |  \n",
      " |  on_deselect(self, callback, append=False)\n",
      " |      Register function to be called when the user deselects points\n",
      " |      in this trace using doubleclick.\n",
      " |      \n",
      " |      Note: Callbacks will only be triggered when the trace belongs to a\n",
      " |      instance of plotly.graph_objs.FigureWidget and it is displayed in an\n",
      " |      ipywidget context. Callbacks will not be triggered on figures\n",
      " |      that are displayed using plot/iplot.\n",
      " |      \n",
      " |      Parameters\n",
      " |      ----------\n",
      " |      callback\n",
      " |          Callable function that accepts 3 arguments\n",
      " |      \n",
      " |          - this trace\n",
      " |          - plotly.callbacks.Points object\n",
      " |      \n",
      " |      append : bool\n",
      " |          If False (the default), this callback replaces any previously\n",
      " |          defined on_deselect callbacks for this trace. If True,\n",
      " |          this callback is appended to the list of any previously defined\n",
      " |          callbacks.\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      None\n",
      " |      \n",
      " |      Examples\n",
      " |      --------\n",
      " |      >>> from plotly.callbacks import Points\n",
      " |      >>> points = Points()\n",
      " |      \n",
      " |      >>> def deselect_fn(trace, points):\n",
      " |      ...     inds = points.point_inds\n",
      " |      ...     # Do something\n",
      " |      \n",
      " |      >>> trace.on_deselect(deselect_fn)\n",
      " |      \n",
      " |      Note: The creation of the `points` object is optional,\n",
      " |      it's simply a convenience to help the text editor perform completion\n",
      " |      on the `points` arguments inside `selection_fn`\n",
      " |  \n",
      " |  on_hover(self, callback, append=False)\n",
      " |      Register function to be called when the user hovers over one or more\n",
      " |      points in this trace\n",
      " |      \n",
      " |      Note: Callbacks will only be triggered when the trace belongs to a\n",
      " |      instance of plotly.graph_objs.FigureWidget and it is displayed in an\n",
      " |      ipywidget context. Callbacks will not be triggered on figures\n",
      " |      that are displayed using plot/iplot.\n",
      " |      \n",
      " |      Parameters\n",
      " |      ----------\n",
      " |      callback\n",
      " |          Callable function that accepts 3 arguments\n",
      " |      \n",
      " |          - this trace\n",
      " |          - plotly.callbacks.Points object\n",
      " |          - plotly.callbacks.InputDeviceState object\n",
      " |      \n",
      " |      append : bool\n",
      " |          If False (the default), this callback replaces any previously\n",
      " |          defined on_hover callbacks for this trace. If True,\n",
      " |          this callback is appended to the list of any previously defined\n",
      " |          callbacks.\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      None\n",
      " |      \n",
      " |      Examples\n",
      " |      --------\n",
      " |      >>> from plotly.callbacks import Points, InputDeviceState\n",
      " |      >>> points, state = Points(), InputDeviceState()\n",
      " |      \n",
      " |      >>> def hover_fn(trace, points, state):\n",
      " |      ...     inds = points.point_inds\n",
      " |      ...     # Do something\n",
      " |      \n",
      " |      >>> trace.on_hover(hover_fn)\n",
      " |      \n",
      " |      Note: The creation of the `points` and `state` objects is optional,\n",
      " |      it's simply a convenience to help the text editor perform completion\n",
      " |      on the arguments inside `hover_fn`\n",
      " |  \n",
      " |  on_selection(self, callback, append=False)\n",
      " |      Register function to be called when the user selects one or more\n",
      " |      points in this trace.\n",
      " |      \n",
      " |      Note: Callbacks will only be triggered when the trace belongs to a\n",
      " |      instance of plotly.graph_objs.FigureWidget and it is displayed in an\n",
      " |      ipywidget context. Callbacks will not be triggered on figures\n",
      " |      that are displayed using plot/iplot.\n",
      " |      \n",
      " |      Parameters\n",
      " |      ----------\n",
      " |      callback\n",
      " |          Callable function that accepts 4 arguments\n",
      " |      \n",
      " |          - this trace\n",
      " |          - plotly.callbacks.Points object\n",
      " |          - plotly.callbacks.BoxSelector or plotly.callbacks.LassoSelector\n",
      " |      \n",
      " |      append : bool\n",
      " |          If False (the default), this callback replaces any previously\n",
      " |          defined on_selection callbacks for this trace. If True,\n",
      " |          this callback is appended to the list of any previously defined\n",
      " |          callbacks.\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      None\n",
      " |      \n",
      " |      Examples\n",
      " |      --------\n",
      " |      >>> from plotly.callbacks import Points\n",
      " |      >>> points = Points()\n",
      " |      \n",
      " |      >>> def selection_fn(trace, points, selector):\n",
      " |      ...     inds = points.point_inds\n",
      " |      ...     # Do something\n",
      " |      \n",
      " |      >>> trace.on_selection(selection_fn)\n",
      " |      \n",
      " |      Note: The creation of the `points` object is optional,\n",
      " |      it's simply a convenience to help the text editor perform completion\n",
      " |      on the `points` arguments inside `selection_fn`\n",
      " |  \n",
      " |  on_unhover(self, callback, append=False)\n",
      " |      Register function to be called when the user unhovers away from one\n",
      " |      or more points in this trace.\n",
      " |      \n",
      " |      Note: Callbacks will only be triggered when the trace belongs to a\n",
      " |      instance of plotly.graph_objs.FigureWidget and it is displayed in an\n",
      " |      ipywidget context. Callbacks will not be triggered on figures\n",
      " |      that are displayed using plot/iplot.\n",
      " |      \n",
      " |      Parameters\n",
      " |      ----------\n",
      " |      callback\n",
      " |          Callable function that accepts 3 arguments\n",
      " |      \n",
      " |          - this trace\n",
      " |          - plotly.callbacks.Points object\n",
      " |          - plotly.callbacks.InputDeviceState object\n",
      " |      \n",
      " |      append : bool\n",
      " |          If False (the default), this callback replaces any previously\n",
      " |          defined on_unhover callbacks for this trace. If True,\n",
      " |          this callback is appended to the list of any previously defined\n",
      " |          callbacks.\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      None\n",
      " |      \n",
      " |      Examples\n",
      " |      --------\n",
      " |      >>> from plotly.callbacks import Points, InputDeviceState\n",
      " |      >>> points, state = Points(), InputDeviceState()\n",
      " |      \n",
      " |      >>> def unhover_fn(trace, points, state):\n",
      " |      ...     inds = points.point_inds\n",
      " |      ...     # Do something\n",
      " |      \n",
      " |      >>> trace.on_unhover(unhover_fn)\n",
      " |      \n",
      " |      Note: The creation of the `points` and `state` objects is optional,\n",
      " |      it's simply a convenience to help the text editor perform completion\n",
      " |      on the arguments inside `unhover_fn`\n",
      " |  \n",
      " |  ----------------------------------------------------------------------\n",
      " |  Methods inherited from plotly.basedatatypes.BasePlotlyType:\n",
      " |  \n",
      " |  __contains__(self, prop)\n",
      " |      Determine whether object contains a property or nested property\n",
      " |      \n",
      " |      Parameters\n",
      " |      ----------\n",
      " |      prop : str|tuple\n",
      " |          If prop is a simple string (e.g. 'foo'), then return true of the\n",
      " |          object contains an element named 'foo'\n",
      " |      \n",
      " |          If prop is a property path string (e.g. 'foo[0].bar'),\n",
      " |          then return true if the obejct contains the nested elements for\n",
      " |          each entry in the path string (e.g. 'bar' in obj['foo'][0])\n",
      " |      \n",
      " |          If prop is a property path tuple (e.g. ('foo', 0, 'bar')),\n",
      " |          then return true if the object contains the nested elements for\n",
      " |          each entry in the path string (e.g. 'bar' in obj['foo'][0])\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      bool\n",
      " |  \n",
      " |  __eq__(self, other)\n",
      " |      Test for equality\n",
      " |      \n",
      " |      To be considered equal, `other` must have the same type as this object\n",
      " |      and their `to_plotly_json` representaitons must be identical.\n",
      " |      \n",
      " |      Parameters\n",
      " |      ----------\n",
      " |      other\n",
      " |          The object to compare against\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      bool\n",
      " |  \n",
      " |  __getitem__(self, prop)\n",
      " |      Get item or nested item from object\n",
      " |      \n",
      " |      Parameters\n",
      " |      ----------\n",
      " |      prop : str|tuple\n",
      " |      \n",
      " |          If prop is the name of a property of this object, then the\n",
      " |          property is returned.\n",
      " |      \n",
      " |          If prop is a nested property path string (e.g. 'foo[1].bar'),\n",
      " |          then a nested property is returned (e.g. obj['foo'][1]['bar'])\n",
      " |      \n",
      " |          If prop is a path tuple (e.g. ('foo', 1, 'bar')), then a nested\n",
      " |          property is returned (e.g. obj['foo'][1]['bar']).\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      Any\n",
      " |  \n",
      " |  __iter__(self)\n",
      " |      Return an iterator over the object's properties\n",
      " |  \n",
      " |  __reduce__(self)\n",
      " |      Custom implementation of reduce is used to support deep copying\n",
      " |      and pickling\n",
      " |  \n",
      " |  __repr__(self)\n",
      " |      Customize object representation when displayed in the\n",
      " |      terminal/notebook\n",
      " |  \n",
      " |  __setattr__(self, prop, value)\n",
      " |      Parameters\n",
      " |      ----------\n",
      " |      prop : str\n",
      " |          The name of a direct child of this object\n",
      " |      value\n",
      " |          New property value\n",
      " |      Returns\n",
      " |      -------\n",
      " |      None\n",
      " |  \n",
      " |  __setitem__(self, prop, value)\n",
      " |      Parameters\n",
      " |      ----------\n",
      " |      prop : str\n",
      " |          The name of a direct child of this object\n",
      " |      \n",
      " |          Note: Setting nested properties using property path string or\n",
      " |          property path tuples is not supported.\n",
      " |      value\n",
      " |          New property value\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      None\n",
      " |  \n",
      " |  on_change(self, callback, *args, **kwargs)\n",
      " |      Register callback function to be called when certain properties or\n",
      " |      subproperties of this object are modified.\n",
      " |      \n",
      " |      Callback will be invoked whenever ANY of these properties is\n",
      " |      modified. Furthermore, the callback will only be invoked once even\n",
      " |      if multiple properties are modified during the same restyle /\n",
      " |      relayout / update operation.\n",
      " |      \n",
      " |      Parameters\n",
      " |      ----------\n",
      " |      callback : function\n",
      " |          Function that accepts 1 + len(`args`) parameters. First parameter\n",
      " |          is this object. Second through last parameters are the\n",
      " |          property / subpropery values referenced by args.\n",
      " |      args : list[str|tuple[int|str]]\n",
      " |          List of property references where each reference may be one of:\n",
      " |      \n",
      " |            1) A property name string (e.g. 'foo') for direct properties\n",
      " |            2) A property path string (e.g. 'foo[0].bar') for\n",
      " |               subproperties\n",
      " |            3) A property path tuple (e.g. ('foo', 0, 'bar')) for\n",
      " |               subproperties\n",
      " |      \n",
      " |      append : bool\n",
      " |          True if callback should be appended to previously registered\n",
      " |          callback on the same properties, False if callback should replace\n",
      " |          previously registered callbacks on the same properties. Defaults\n",
      " |          to False.\n",
      " |      \n",
      " |      Examples\n",
      " |      --------\n",
      " |      \n",
      " |      Register callback that prints out the range extents of the xaxis and\n",
      " |      yaxis whenever either either of them changes.\n",
      " |      \n",
      " |      >>> fig.layout.on_change(\n",
      " |      ...   lambda obj, xrange, yrange: print(\"%s-%s\" % (xrange, yrange)),\n",
      " |      ...   ('xaxis', 'range'), ('yaxis', 'range'))\n",
      " |      \n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      None\n",
      " |  \n",
      " |  pop(self, key, *args)\n",
      " |      Remove the value associated with the specified key and return it\n",
      " |      \n",
      " |      Parameters\n",
      " |      ----------\n",
      " |      key: str\n",
      " |          Property name\n",
      " |      dflt\n",
      " |          The default value to return if key was not found in object\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      value\n",
      " |          The removed value that was previously associated with key\n",
      " |      \n",
      " |      Raises\n",
      " |      ------\n",
      " |      KeyError\n",
      " |          If key is not in object and no dflt argument specified\n",
      " |  \n",
      " |  to_plotly_json(self)\n",
      " |      Return plotly JSON representation of object as a Python dict\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      dict\n",
      " |  \n",
      " |  update(self, dict1=None, **kwargs)\n",
      " |      Update the properties of an object with a dict and/or with\n",
      " |      keyword arguments.\n",
      " |      \n",
      " |      This recursively updates the structure of the original\n",
      " |      object with the values in the input dict / keyword arguments.\n",
      " |      \n",
      " |      Parameters\n",
      " |      ----------\n",
      " |      dict1 : dict\n",
      " |          Dictionary of properties to be updated\n",
      " |      kwargs :\n",
      " |          Keyword/value pair of properties to be updated\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      BasePlotlyType\n",
      " |          Updated plotly object\n",
      " |  \n",
      " |  ----------------------------------------------------------------------\n",
      " |  Data descriptors inherited from plotly.basedatatypes.BasePlotlyType:\n",
      " |  \n",
      " |  __dict__\n",
      " |      dictionary for instance variables (if defined)\n",
      " |  \n",
      " |  __weakref__\n",
      " |      list of weak references to the object (if defined)\n",
      " |  \n",
      " |  figure\n",
      " |      Reference to the top-level Figure or FigureWidget that this object\n",
      " |      belongs to. None if the object does not belong to a Figure\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      Union[BaseFigure, None]\n",
      " |  \n",
      " |  parent\n",
      " |      Return the object's parent, or None if the object has no parent\n",
      " |      Returns\n",
      " |      -------\n",
      " |      BasePlotlyType|BaseFigure\n",
      " |  \n",
      " |  plotly_name\n",
      " |      The plotly name of the object\n",
      " |      \n",
      " |      Returns\n",
      " |      -------\n",
      " |      str\n",
      " |  \n",
      " |  ----------------------------------------------------------------------\n",
      " |  Data and other attributes inherited from plotly.basedatatypes.BasePlotlyType:\n",
      " |  \n",
      " |  __hash__ = None\n",
      "\n"
     ]
    }
   ],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [
    {
     "ename": "ValueError",
     "evalue": "\nThe orca executable is required to export figures as static images,\nbut it could not be found on the system path.\n\nSearched for executable 'orca' on the following path:\n    /home/ec2-user/anaconda3/envs/python3/bin\n    /usr/libexec/gcc/x86_64-amazon-linux/4.8.5\n    /usr/local/cuda/bin\n    /usr/local/bin\n    /opt/aws/bin\n    /usr/local/mpi/bin\n    /usr/libexec/gcc/x86_64-amazon-linux/4.8.5\n    /usr/local/cuda/bin\n    /usr/local/bin\n    /opt/aws/bin\n    /home/ec2-user/src/cntk/bin\n    /usr/local/mpi/bin\n    /usr/libexec/gcc/x86_64-amazon-linux/4.8.5\n    /home/ec2-user/anaconda3/bin/\n    /usr/local/cuda/bin\n    /usr/local/bin\n    /opt/aws/bin\n    /usr/local/mpi/bin\n    /usr/libexec/gcc/x86_64-amazon-linux/4.8.5\n    /usr/local/cuda/bin\n    /usr/local/bin\n    /opt/aws/bin\n    /home/ec2-user/src/cntk/bin\n    /usr/local/mpi/bin\n    /home/ec2-user/anaconda3/envs/JupyterSystemEnv/bin\n    /home/ec2-user/anaconda3/bin/\n    /usr/libexec/gcc/x86_64-amazon-linux/4.8.5\n    /usr/local/cuda/bin\n    /usr/local/bin\n    /opt/aws/bin\n    /usr/local/mpi/bin\n    /usr/libexec/gcc/x86_64-amazon-linux/4.8.5\n    /usr/local/bin\n    /bin\n    /usr/bin\n    /usr/local/sbin\n    /usr/sbin\n    /sbin\n    /opt/aws/bin\n    /opt/aws/bin\n\nIf you haven't installed orca yet, you can do so using conda as follows:\n\n    $ conda install -c plotly plotly-orca\n\nAlternatively, see other installation methods in the orca project README at\nhttps://github.com/plotly/orca.\n\nAfter installation is complete, no further configuration should be needed.\n\nIf you have installed orca, then for some reason plotly.py was unable to\nlocate it. In this case, set the `plotly.io.orca.config.executable`\nproperty to the full path of your orca executable. For example:\n\n    >>> plotly.io.orca.config.executable = '/path/to/orca'\n\nAfter updating this executable property, try the export operation again.\nIf it is successful then you may want to save this configuration so that it\nwill be applied automatically in future sessions. You can do this as follows:\n\n    >>> plotly.io.orca.config.save()\n\nIf you're still having trouble, feel free to ask for help on the forums at\nhttps://community.plot.ly/c/api/python\n",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mValueError\u001b[0m                                Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-39-c5c324186047>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m()\u001b[0m\n\u001b[1;32m     13\u001b[0m )\n\u001b[1;32m     14\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 15\u001b[0;31m \u001b[0mfig\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mwrite_image\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mfile\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;34m\"testmap\"\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mformat\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;34m\"png\"\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m",
      "\u001b[0;32m~/anaconda3/envs/python3/lib/python3.6/site-packages/plotly/basedatatypes.py\u001b[0m in \u001b[0;36mwrite_image\u001b[0;34m(self, *args, **kwargs)\u001b[0m\n\u001b[1;32m   2682\u001b[0m         \u001b[0;32mimport\u001b[0m \u001b[0mplotly\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mio\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0mpio\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   2683\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m-> 2684\u001b[0;31m         \u001b[0;32mreturn\u001b[0m \u001b[0mpio\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mwrite_image\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m*\u001b[0m\u001b[0margs\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0mkwargs\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m   2685\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   2686\u001b[0m     \u001b[0;31m# Static helpers\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/python3/lib/python3.6/site-packages/plotly/io/_orca.py\u001b[0m in \u001b[0;36mwrite_image\u001b[0;34m(fig, file, format, scale, width, height, validate)\u001b[0m\n\u001b[1;32m   1703\u001b[0m     \u001b[0;31m# Do this first so we don't create a file if image conversion fails\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1704\u001b[0m     img_data = to_image(\n\u001b[0;32m-> 1705\u001b[0;31m         \u001b[0mfig\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mformat\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mformat\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mscale\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mscale\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mwidth\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mwidth\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mheight\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mheight\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mvalidate\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mvalidate\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m   1706\u001b[0m     )\n\u001b[1;32m   1707\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/python3/lib/python3.6/site-packages/plotly/io/_orca.py\u001b[0m in \u001b[0;36mto_image\u001b[0;34m(fig, format, width, height, scale, validate)\u001b[0m\n\u001b[1;32m   1480\u001b[0m     \u001b[0;31m# Make sure orca sever is running\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1481\u001b[0m     \u001b[0;31m# -------------------------------\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m-> 1482\u001b[0;31m     \u001b[0mensure_server\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m   1483\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1484\u001b[0m     \u001b[0;31m# Handle defaults\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/python3/lib/python3.6/site-packages/plotly/io/_orca.py\u001b[0m in \u001b[0;36mensure_server\u001b[0;34m()\u001b[0m\n\u001b[1;32m   1342\u001b[0m     \u001b[0;31m# Validate orca executable\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1343\u001b[0m     \u001b[0;32mif\u001b[0m \u001b[0mstatus\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mstate\u001b[0m \u001b[0;34m==\u001b[0m \u001b[0;34m\"unvalidated\"\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m-> 1344\u001b[0;31m         \u001b[0mvalidate_executable\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m   1345\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1346\u001b[0m     \u001b[0;31m# Acquire lock to make sure that we keep the properties of orca_state\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/python3/lib/python3.6/site-packages/plotly/io/_orca.py\u001b[0m in \u001b[0;36mvalidate_executable\u001b[0;34m()\u001b[0m\n\u001b[1;32m   1041\u001b[0m                 \u001b[0mexecutable\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mconfig\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mexecutable\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1042\u001b[0m                 \u001b[0mformatted_path\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mformatted_path\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m-> 1043\u001b[0;31m                 \u001b[0minstructions\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0minstall_location_instructions\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m   1044\u001b[0m             )\n\u001b[1;32m   1045\u001b[0m         )\n",
      "\u001b[0;31mValueError\u001b[0m: \nThe orca executable is required to export figures as static images,\nbut it could not be found on the system path.\n\nSearched for executable 'orca' on the following path:\n    /home/ec2-user/anaconda3/envs/python3/bin\n    /usr/libexec/gcc/x86_64-amazon-linux/4.8.5\n    /usr/local/cuda/bin\n    /usr/local/bin\n    /opt/aws/bin\n    /usr/local/mpi/bin\n    /usr/libexec/gcc/x86_64-amazon-linux/4.8.5\n    /usr/local/cuda/bin\n    /usr/local/bin\n    /opt/aws/bin\n    /home/ec2-user/src/cntk/bin\n    /usr/local/mpi/bin\n    /usr/libexec/gcc/x86_64-amazon-linux/4.8.5\n    /home/ec2-user/anaconda3/bin/\n    /usr/local/cuda/bin\n    /usr/local/bin\n    /opt/aws/bin\n    /usr/local/mpi/bin\n    /usr/libexec/gcc/x86_64-amazon-linux/4.8.5\n    /usr/local/cuda/bin\n    /usr/local/bin\n    /opt/aws/bin\n    /home/ec2-user/src/cntk/bin\n    /usr/local/mpi/bin\n    /home/ec2-user/anaconda3/envs/JupyterSystemEnv/bin\n    /home/ec2-user/anaconda3/bin/\n    /usr/libexec/gcc/x86_64-amazon-linux/4.8.5\n    /usr/local/cuda/bin\n    /usr/local/bin\n    /opt/aws/bin\n    /usr/local/mpi/bin\n    /usr/libexec/gcc/x86_64-amazon-linux/4.8.5\n    /usr/local/bin\n    /bin\n    /usr/bin\n    /usr/local/sbin\n    /usr/sbin\n    /sbin\n    /opt/aws/bin\n    /opt/aws/bin\n\nIf you haven't installed orca yet, you can do so using conda as follows:\n\n    $ conda install -c plotly plotly-orca\n\nAlternatively, see other installation methods in the orca project README at\nhttps://github.com/plotly/orca.\n\nAfter installation is complete, no further configuration should be needed.\n\nIf you have installed orca, then for some reason plotly.py was unable to\nlocate it. In this case, set the `plotly.io.orca.config.executable`\nproperty to the full path of your orca executable. For example:\n\n    >>> plotly.io.orca.config.executable = '/path/to/orca'\n\nAfter updating this executable property, try the export operation again.\nIf it is successful then you may want to save this configuration so that it\nwill be applied automatically in future sessions. You can do this as follows:\n\n    >>> plotly.io.orca.config.save()\n\nIf you're still having trouble, feel free to ask for help on the forums at\nhttps://community.plot.ly/c/api/python\n"
     ]
    }
   ],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "alright cities and states are implemented"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "def cypher(driver, query, results_columns):\n",
    "    \"\"\"input is a neo4j connection driver, a string representing a cypher query\n",
    "    and a list of string for data frame column names. returns the dataframe of the results.\"\"\"\n",
    "    \n",
    "    with driver.session() as session:\n",
    "        result = session.run(query)\n",
    "        \n",
    "    result_df = pd.DataFrame(result.values() , columns=results_columns)\n",
    "    \n",
    "    return result_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "cypher(driver,\"MATCH (u:User)-[:WROTE]->(:Review)-[:REVIEWS]->(:Business)-[:IN_CITY]->(:City)-[:IN_STATE]->(s:State)\\\n",
    "CREATE (u)-[:REVIEWS_IN]->(s)\", None)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "cypher(driver,\"MATCH (u:User)-[:WROTE]->(:Review)-[:REVIEWS]->(:Business)-[:IN_CITY]->(:City)-[:IN_STATE]->(s:State)\\\n",
    "CREATE (u)-[:REVIEWS_IN]->(s)\", None)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "conda_python3",
   "language": "python",
   "name": "conda_python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
